[
	{
		"reviewerName": "Preet Shah",
		"reviewTitle": "Easy to use, hard to carry",
		"reviewBody": "Pros: easy to use, keys feels like mechanical keyboard. Can connect 3 devices. Supports Mac and windows. Place holder for mobile devices ( However, I use it to place a pen)Cons: Expensive. Very heavy ( feels like Macbook air). There is lag in connection whenever you turn on your laptop.",
		"reviewStars": 4
	},
	{
		"reviewerName": "nirmal",
		"reviewTitle": "Not suitable for all",
		"reviewBody": "Only uses for typing if horizontal view is suitable to see what we typingThink twice before buying",
		"reviewStars": 4
	},
	{
		"reviewerName": "Haidri",
		"reviewTitle": "I don't like it because it not having urdu, persion language to write,",
		"reviewBody": "I don't like it because it not having urdu, persion languages to write,What it good in it, that is size, tecnology, performance..",
		"reviewStars": 4
	},
	{
		"reviewerName": "ABDUL BASITH",
		"reviewTitle": "Absolute Rubbish -> Moderately Good Product",
		"reviewBody": "Not working properly on macbook pro! Switches to junk characters frequently which is really frustrating!How did I fix ?The keyboard switches to symbol/junk characters when the option key is pressed. So, I had to disable the option key in the keyboard and live with it!Apart from that above problem, It's a good looking keyboard. The keys are smooth to handle. Due to its container for tablet/phones, the product is not as compact as you might be expecting.",
		"reviewStars": 4
	},
	{
		"reviewerName": "abhinav",
		"reviewTitle": "Good Product for multiple connectivity",
		"reviewBody": "Thumps up guys!!",
		"reviewStars": 4
	},
	{
		"reviewerName": "Parth Arora",
		"reviewTitle": "Better than expected",
		"reviewBody": "Build Quality is appreciable, does not feel like other cheap keyboards. Bluetooth connectivity is also great, connects to multiple devices with instant switching across devices. Worked well with the ipad.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Latha Pillai",
		"reviewTitle": "Amazing product",
		"reviewBody": "Amazing product! Makes it super simple to work on multiple devices at the same time",
		"reviewStars": 5
	},
	{
		"reviewerName": "Rajesh Rathi",
		"reviewTitle": "Good portable keyboard to connect to multiple devices",
		"reviewBody": "It cleared clutter on my workstation. Keyboard is noisy and arrow keys are very small.",
		"reviewStars": 4
	},
	{
		"reviewerName": "pravinjha",
		"reviewTitle": "As expected and upto the mark",
		"reviewBody": "Very robust and stable. Easy to use as expected from Logitech.",
		"reviewStars": 5
	},
	{
		"reviewerName": "VINEET SHARMA",
		"reviewTitle": "Rugged",
		"reviewBody": "Sturdy product. But you have to use it with mouse as you can not select as there is no touch pad. Good for typing.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Dharmendra Kushwaha",
		"reviewTitle": "Thats awesome",
		"reviewBody": "Easy to use build quality premium good product",
		"reviewStars": 4
	},
	{
		"reviewerName": "Pratik S.",
		"reviewTitle": "Decent keyboard but keys could be better",
		"reviewBody": "The keys are really hard, but the connectivity part and the portability of the keyboard is good. IT connects well with 2 devices.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Kannan",
		"reviewTitle": "It's a good device for the money.",
		"reviewBody": "ProsPortabilityConsFlimsy keysHeavyApart from this it's a good device",
		"reviewStars": 4
	},
	{
		"reviewerName": "name",
		"reviewTitle": "portable, ideal for work",
		"reviewBody": "great one for connecting to multiple devices. compatible with both iOS and Windows",
		"reviewStars": 4
	},
	{
		"reviewerName": "Ranjan Banerjee",
		"reviewTitle": "Portability.",
		"reviewBody": "Ease of portability & usage. Am not a gaming junky, hence, no comments. Yes, while on the move, very useful, can use both hands for speedy typing.I have paired the keyboard with my mobile phone.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Sumit Bhatnagar",
		"reviewTitle": "Great product but",
		"reviewBody": "My video says it all.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Manish Sabnis",
		"reviewTitle": "GENUINE REVIEW. NO MARKETING. keyboard serves the purpose but its definitely not the best !!",
		"reviewBody": "Built - Typical logitech keyboard. Premium plastic material, heavy built. weighs more than a kilo.Portability - Definitely cumbersome to carry in backpack as it weighs just like any 14 inch laptop. But if you consider its price as compared to the apple ipad keyboard, its worth buying. It takes space of 14 inch laptop in a backpack.Ergonomics - it stands firm on any surface due to weight. it can carry weight of two large screen mobiles at a same time when they are parked in the fluorescent yellow slot or it can accommodate and balances weight of a 9 inch ipad and to that matter 12.9 ipad in portrait position. it never topples it contents. the keys are small and there is extra space between keys. those with medium to long fingers and those who have habit of tactile typing will be able to use it happily. the keys have matt finish for better finger grips but keypress are not soft. you need to apply some force while typing. it comes typically between apply magic keyboard and logitech desktop keyboard. typical experience is good but not the best.  key travel is about 2-3 mm which is adequate for getting a feedback while typing but there is no palpable bump or click for feedback from the keys. keys are typical memmbrane keys and at this premium price one miss the ease of typing on mechanical keys.The keyboard does not have any arrangement of increasing the inclination while typing so if we are sitting lower than the table, then it becomes cumbersome to type on the keyboard. there is no way you can lift its front part.. there are no extra foot pegs. the standard inclination provided by the keyboard frame is about 5-6 degrees.Battery - i am using it for two weeks and there has been not change in the battery levels as checked from within the app. definitely its battery efficient.Gaming - it can be used for casual gaming but definitely not good for serious FPS gaming. there is a definite latency when i tested it while playing game Forza Horizon. It can be used for racing games but not for multiplayers FPS games. The keys are firm and should withstand the brute force while playing games.The dial provided for switching between devices works flawless and instantly. I use it with windows 10 laptop, ipad and android phone. it works flawless. words coming instantly on the screen of the phone and typing with fast pace in social messangers really feels awesome. you are always the faster one amongst the group chat. its a good companion for those who use lots of social media from cellphone and want to improve their productivity by improving the typing speed and accuracy.Verdict - A definite YES for those who want portability, wase of switching between three different devices while typing and for those who want value for money keyboard for 2.5K budget. For casual gamers this is still a YES... for serious gamers its a NO.. go for a decent mechanical keyboard at this cost. For those who have iPad and want to increase their productivity and want near complete functionalities of a laptop without much cost, this is the best possible keyboard as it negates need for ipad stand which also costs a lot on amazon. So go for it. !",
		"reviewStars": 4
	},
	{
		"reviewerName": "Winston R.",
		"reviewTitle": "Nice keyboard for the given price",
		"reviewBody": "Keybord is sturdy and can connect with 3 devices and we can switch easily between devices without any hassle. Please note it's not suitable for tablets beyond 12 inch as the given slot can't hold your device in landscape mode, even though we keep in portrait mode tabs more than 12inch just fall. So anyone planning to buy it for a 12 inch tabs get a tab cover or a stand to hold your device in landscape mode and then we can use this keyboard.Pros:Built quality is goodKeybord is heavy to balance the weight of tabs less than 12 inch.Easily connected with Android and windows devices.Cons: can't accommodate bigger tabs.Overall: perfect for typing and a best alternative for a physical keybord for tablets.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Devendra",
		"reviewTitle": "Good product can be further refined",
		"reviewBody": "I purchased this product almost 3 weeks before and am able to connect to multiple devices.Pros1) It switches between the devices seamlessly.2) At this price point its a worth buying.Cons1) Some hot keys are not present e.g. Home, End, Page-Up, Page-Down2) When typing keys makes noise3) Keyboard is not lighted.4) Doesn't have hinge to change the inclination/height of the keyboard.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Devjeet",
		"reviewTitle": "One year back manufactured battery with packaging",
		"reviewBody": "I have ordered in 2022 but got the battery with the Logitech K480 which is manufactured in one year back 2021 that's  disappoint me.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Ravi Maurya",
		"reviewTitle": "High quality product. But No backlit",
		"reviewBody": "Build quality is great. Really good typing experience.At this price it should have backlit also.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Abhishek Ipsit",
		"reviewTitle": "Good for multiple devices",
		"reviewBody": "Hi, I have been using this keyboard for both official, personal as well as my study purpose. I have been using 3 different devices to work where I may need 3 different keyboards. So without any hassles, I can switch multiple devices with just toggling the switcher.This really helped me working with portability.Just one more info for people who were asking for gaming - You can use for light gaming purposes, but if you will face ghosting, multi key  register issues. You can play lighter games but not high-end Fps or any online games.Just 2 cons1. This keyboard is powered by AAA battery which for some people this will be a hassle for recharging or replacing the battery2. As you can see there is a tablet/ mobile holder in the keyboard. Though my tab is 12.4 inch, you can put your devices below 10 inch so literally that feature is useless for me.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Kashif Husain",
		"reviewTitle": "Awesome",
		"reviewBody": "Awesome keyboard",
		"reviewStars": 5
	},
	{
		"reviewerName": "Vinayan_Mahesan",
		"reviewTitle": "So good!",
		"reviewBody": "This keyboard feels so good I like how you connect up to 3 devices very good product by logitech",
		"reviewStars": 5
	},
	{
		"reviewerName": "Sriram D.",
		"reviewTitle": "Very comfortable to use",
		"reviewBody": "no strain on the wrists, even this review is typed with the K480",
		"reviewStars": 5
	},
	{
		"reviewerName": "pallavi saxena",
		"reviewTitle": "Not meant for travelling",
		"reviewBody": "Product is of premium quality and trusted brand, but weight is surely more then written on discription, thickness and weight are two parameters which make it not suitable for travelling, i mean with a tab of half kg why would anyone carry carry a keyboard weight twice its weight. For a stationary station it is a good product",
		"reviewStars": 3
	},
	{
		"reviewerName": "S. Black",
		"reviewTitle": "Perfect. Absolutely beautiful. Love the way it works",
		"reviewBody": "Absolute delight to use. Connects in less than a minute. The batteris are included. Easy to work with. Can take a screenshot from the keyboard. Very easy to use. If you love to type on a keyboard, with no wires attached - then this is the best option. It is portable and very easy to work with. Love it.",
		"reviewStars": 5
	},
	{
		"reviewerName": "AN-G",
		"reviewTitle": "Nifty and quite useful, love the connection across devices",
		"reviewBody": "I bought this for my iPad Air (2020 edition) and it has been five months since I first began using it. Here are my takeaways in case you are on the fence about buying it:Price: Easily 5 stars. To be able to access full typing functionality on the iPad, while also being able to seamlessly text on my mobile or reply to an email on my laptop has been extremely handy. The keyboard cases cost three times in comparison and while they're obviously placed at that price point for a reason, this covers what I need.Keys: Typing takes a little to get used to, especially if you're like me and had to handle gentle keys on the laptop keyboard. Five months in, I've settled into this and am able to conveniently punch in as I need. The smaller size does mean you need to have the keypad closer to access than say a standard keyboard, but if you're working at a study table (as I do) or can alternate by using a bed table you can adjust to your height, you should be able to get by.Pairing: Simple, easy and effortless. Getting any BT device to connect with my laptop is generally a nightmare but I faced no such problem with the keyboard.The cradle: The cradle/dock to hold your device indeed is the real deal. My iPad stays docked in place while I use it (sideways) to type out lengthy essays. It does manage to stay put in the vertical position as well but that is a risk I'd rather avoid by placing it on the tablet stand I have for this purpose.Portability: This has been the single pain point. The keyboard is fairly heavy and unfortunately there do not seem to be any cases made to keep it safe while traveling. For use at home the box in which the keyboard was supplied does the job, but I hope to see case options that allow for storage of the keyboard along with the tablet, if not just the keyboard. I'll mostly purchase a laptop sleeve and adjust with it.My verdict? Go for it. This is a purchase that will serve you a world of good.",
		"reviewStars": 4
	},
	{
		"reviewerName": "RG",
		"reviewTitle": "Its nice.",
		"reviewBody": "Its good but there's connectivity issue. The instructions aren't given properly either. Also its a little too heavy to carry. The size is a bit unusual so its hard to find cover sleeves for the keys as well as the pouch size in which i will be able to carry it properly. Moreover, you meed to spend extra 1k almost after buying this laptop.. so i won't say it's affordable..ot works fine but still....",
		"reviewStars": 4
	},
	{
		"reviewerName": "Azhar",
		"reviewTitle": "Product is average and the price is too high.",
		"reviewBody": "Costly and average product.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Shafiullah",
		"reviewTitle": "Doesn't hold newer iPads properly.",
		"reviewBody": "The keyboard is awesome and the quality is as expected from Logitech  which is good. Shifting between devices is a breeze. Way better than apple keyboards you can fast forward on YouTube which is not possible on apple keyboards. I use the iPad Air 5th gen and it keeps slipping backward and falls over from the stand.Previously used it for iPad 4th gen and it fit perfectly.",
		"reviewStars": 4
	},
	{
		"reviewerName": "hitesh bhalodia",
		"reviewTitle": "Very good purchase..",
		"reviewBody": "Quality is very good. Easy to use. I m using with my Samsung tab and I tried to connect with my iPhone. Very easy to connect with device. It's best part is, support Indian language typing like hindi, Gujarati. I tried both. Want to buy wireless keyboard then go for it.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Piyush Bhutoria",
		"reviewTitle": "Convenient multi-device typing instrument at a budget friendly figure.",
		"reviewBody": "Very convenient and useful typing device. Could have been a bit lighter but if at the cost of compromising quality, no need.Instantly switches between devices. Typing is ergonomically convenient. Response rate could be a bit better but not a problem if a user is willing to adjust slightly. For high performance data input jobs, it might not be a good solution.",
		"reviewStars": 4
	},
	{
		"reviewerName": "thefooddude__",
		"reviewTitle": "Is very bulky, weighs as much as a brim and more",
		"reviewBody": "A great device, but with the bulk it is not portable and would hinder its on the go use.",
		"reviewStars": 4
	},
	{
		"reviewerName": "raja kumar",
		"reviewTitle": "Very Good",
		"reviewBody": "Easily you can put a 11 inch tablet. Connectivity is good. Along with key MI PAD 5, becomes like a mini computer.",
		"reviewStars": 5
	},
	{
		"reviewerName": "DHANERAM MURTHY",
		"reviewTitle": "Product Quality",
		"reviewBody": "Good Product",
		"reviewStars": 5
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "Fantastic product….but price is slightly higher side",
		"reviewBody": "Nice",
		"reviewStars": 5
	},
	{
		"reviewerName": "John Alfred",
		"reviewTitle": "Best Wireless Keyboard !!!",
		"reviewBody": "Versatile Wireless Keyboard from Logitech !!!Just Loving it !!!Bluetooth Connectivity- top notch - 5/5Pairs instantly with all 3 devices within instant !!I am using it for myiPad Air 4geniPhone 12Lenovo LaptopChange switch works like magic !!!Dedicated connectivity switch works perfectly connects devices within few minutes andAdding new devices is very easy !!!Cons !!!!!!!!iPad Air when kept without case in dedicated slot flips and falls down !!!Definitely it will need a thin case or coveriPad will not fit in the slot with rigged case !!But Truly a versatile device !!!Really helpful !!!",
		"reviewStars": 5
	},
	{
		"reviewerName": "Venkatesh",
		"reviewTitle": "Good general purpose keyboard if you switch between multiple devices.",
		"reviewBody": "This is a good keyboard if you need to constantly switch between multiple systems ( I switch between 2 laptops and 1 ipad). Switching is really really easy due to the switch wheel and switching is pretty fast.Shortcut keys provided for ipad is very good and works well. the slot provided to keep tablet/mobile is at a perfect angle and works really well. Battery is good . Overall keyboard is well built and does not flex when using.Cons:Keyboard is quite heavy (required to support ipad in the slot) - so not exactly something you would carry around in a backpack all the time.Keys are slightly on the harder side to press and is VERY noisy. If I am on a call and typing, others will hear it and complain that it is too loud. If you are working around others , this might not be the best keyboard to use.To switch the media keys to function keys , you would need to use to install the \"Logitech options\" software - I wish this could have been done at a keyboard level (fn + escape?) .Overall, good , compact keyboard with decent functionality for day to day use.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Rahul Kunwar",
		"reviewTitle": "Do read if you want to buy it for your iPad Pro 2018 & 2019 Model.",
		"reviewBody": "Glossy surface with abs plastic keys, surface is scratch magnet but keys are nice (visually) . Connectivity is also good. You can check for specs.I got it today only and it felt good, heavier but it has cradle to hold ipad or smartphone so it has to be on heavier side. No back-lit since it operates on AAA batteries.It was able to hold my phone in cradle but when it comes to ipad pro 11, it could hold it for 5 mins only. Because the ridge or cradle is curved from inside and ipad pro has flat Brick design, it couldn't stick. Slips and falls. What I did to make it work is just to apply some silicon glue through glue gun on it. It will not affect the plastic of keyboard. It helped increasing the angle of inclination and now the CM is right below the cradle. Hence, avoiding the slip and fall of ipad.I didn't return it because there are not many such products available and it really has nice response and swift keys. Now it is working just fine, thanks to glue gun. This keyboard will work with previous models of ipad and other tablets (without any guarantees since angle of inclination will remain same as in mine). But for ipad pro 11 (2018 & 2019) you have to apply some frugal engineering just like i did to hold the the product in cradle. Designers and engineers didn't work well to make it a stable product. It will hold smaller devices like 6 or 7 Inch pads or smartphones, 11 inch is a bit heavier for it but little \"Jugaad\" makes it possible.I'm happy with the response and quality given the price range but i would just rate it 3 since engineering hasn't been upto the mark.Now keyboard usability and workability: I think keys will not be able to hold harsh pressing and are not as tough as normal keyboards are, its a little sensitive in the sense of delicacy. Looks fragile on that front. I have uploaded the videos too. The quality of battery lid is fragile, I'm not sure of how long will it stay for but I will try not to push it too much since it can break easily.Why i bought it?I can connect ipad, mobile (definitely I'll not text using keyboard that much, i don't why i said mobile here!) and also TV. This is the. Only reason i bought it plus price. Else i would've love to go for apple official keyboard if it fails on ipad.This sums up my review. I know it is not technical review but i feel there is no need since you can always compare tech specs online any where. This is a layman user review from a professional product Designer who works on Ergonomics and usability of product.Thanks for taking time to read.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Dilipan R",
		"reviewTitle": "Multiple device connection is now Hazzle Free",
		"reviewBody": "A goto keyboard if you are using multiple devices at the same time.I've connected it to my Office Laptop, Personal Laptop n my Tab.Switching between the devices is hassle free.A little noisy but not a deal breaker.Suits my need perfectly at this price point.",
		"reviewStars": 5
	},
	{
		"reviewerName": "M S Kakade",
		"reviewTitle": "Good Keyboard",
		"reviewBody": "I was looking for a Bluetooth keyboard to use it with my iPad at home. I must say that I was virtually lost looking at multitudes of them in the market, with such a widespread price range.  I did not want one of those fancy keyboards with an integral cover in which the iPad is to be 'inserted' as I already have a flip cover with a hard shell back : these are also much more expensive.So the obvious choice was a simple Bluetooth Keyboard and the Logitech Keyboard fitted the bill as it was a 'branded' Keyboard. The reviews of this keyboard were also good, but there was another problem : the Logitech K380 was equally impressive and I was in a dilemma which one to choose.  Apart from the price difference (the K380 is a good Rs 600 cheaper), other distinct advantages of the K380 are being lighter, compact and the keys quieter.  The only disadvantage that I saw in this Keyboard is that the iPad will have to be rested directly on the table and the iPad / Keyboard combination cannot be used as a 'laptop' if you want to use them on your lap !This is where I made the decision in favour of the K480. The dock in which the iPad rests is great with a comfortable viewing angle : it is as good as a 'Laptop' !  The dock is rubberised and the iPad does not fall off, unless forced out. I use the iPad often while seated in my sofa comfortably. It has been worth the extra Rs 600 for this feature.  I was a little sceptical if I could use the iPad in the dock without having to remove the flip cover.  If it was needed to be removed, I wouldn't have bought it and put up a question on Amazon too. Unfortunately, the answers I got weren't satisfactory; nevertheless, I decided to take the risk and buy it.  After receiving the Keyboard, this was the first thing that I checked for and was pleasantly surprised to see that the iPad with a flip cover (and a shell back cover) fits very well in the dock.  To add to that, when the flip cover is put over the iPad, it goes to sleep, without having to remove the iPad from the dock !Other common features of the K480 and K380 include :1.  Long battery life (2 years claimed by the manufacturer); 2 AAA batteries are included in the package2.  Easy and quick connectivity between the keyboard and the iPad3.  The keyboard doesn't require to be switched off; it goes to 'sleep' and wakes us almost instantaneously when any key is pressed4.  Many short-cut keys for use with an iPad : I understand that these short-cut keys work equally well with other tablets / android phones too5.  Connectivity to three devices (not simultaneously though) which can be switched using a rotary switch in the case of K480 and three keys in the case of K380I had read in some of the reviews of letter dropping. I've not face this problem, probably because my typing speed isn't too fast.Build quality is not great and that is the primary reason for the 4 stars, besides the other shortcomings when compared to the K380. If only Logitech had a dock on the K380 !To sum-up, it is a good product for the price : go for it.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Ram Sundar",
		"reviewTitle": "Good Keyboard but not so good for long hours of typing",
		"reviewBody": "The Bluetooth keyboard can be paired quite easily with any device, and the toggle is of good use to switch between devices instantly. The keys are sturdy and good for typing for short period of time. The feedback and the typing experience is not as good as you would expect in a dedicated stand alone keyboard. The typing experience can be rated as Just Ok and nothing better. If you want a keyboard for long hours of typing like report preparation or story writing or any long hour task, choose some other keyboard; else for normal typing in different devices you can go for this one but still not worth the price.",
		"reviewStars": 4
	},
	{
		"reviewerName": "krandhi divakar",
		"reviewTitle": "Nice product",
		"reviewBody": "Build quality of the keyboard is good.Must buy keyboard for using 2 to 3 device simultaneously. Iam using for my desktop and iPad switch between these two device very smooth and easy by using round nob.I will recommend to all use this keyboard.Keys are little bit hard to press. It's not issue for me, But somebody feel the hard.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "good",
		"reviewBody": "Good",
		"reviewStars": 5
	},
	{
		"reviewerName": "Vivek",
		"reviewTitle": "Quite good actually!",
		"reviewBody": "Has a very few shortcuts but overall quite a good product.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Madan Samaga",
		"reviewTitle": "Good product but has connectivity issues",
		"reviewBody": "The product is good to use for work. But it is only connecting through Bluetooth. There is no USB to connect.",
		"reviewStars": 4
	},
	{
		"reviewerName": "NGULJATHONG CHONGLOI",
		"reviewTitle": "Amazing",
		"reviewBody": "It's cool, it's sleek, it's useful and i really like it. I bought if for 1560/-",
		"reviewStars": 5
	},
	{
		"reviewerName": "Akash",
		"reviewTitle": "Good keyboard, but not for fast typing",
		"reviewBody": "I got this keyboard about a month ago, and I have been using this on and off since then. This is a very well built keyboard, with the keys being well spaced out so that you can type without your fingers being cramped. I did not face any issues in pairing with my windows laptop, my android phone or my iPad. The device selector switch works really great with no perceptable lag in switching between devices. Finally, the groove on top of the keyboard to place your mobile or iPad is really well designed -- it has a slight tilt so that you can easily see the screen while you type, and at the same time it holds your device secured so you have peace of mind that it will not fall off when you are busy typing.However, not everything is great. This is a loud keyboard, so if you are planning to use this in a quiet place like a library, it will not work out. While the keys are spaced out well, it is missing dedicated home, end, page up and page down keys. The greatest issue however is that the keys are a hard to press, and unless you press the keys just right, they will not register. This is fine for slow typing, but as soon as you try going faster, characters not registering get more and more prominent.  I have tried to make this my primary keyboard, but for the above reason, I am not able to. There is another issue with the function keys by default set to the special functions, and to get to the F1 to F12 keys, you would need to press the fn key on the bottom row, and that gets annoying. I am told that you can change this using the logitech software, but strangely, I could not find this on the logitech site.So overall, well built, but not meeting the purpose for me.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Pallav Chutia",
		"reviewTitle": "Value for money...",
		"reviewBody": "Awesome  product..I like it",
		"reviewStars": 5
	},
	{
		"reviewerName": "Abhijit Dandekar Sentio",
		"reviewTitle": "Bluetooth connection is excellent. Keys very smooth. Great build quality typical of Logitech.",
		"reviewBody": "Perfect replacement for the USB wireless keyboard. Connected easily with laptop and mobile. Switching between the devices is easy. Keys are smooth and moderate clicking sound. Keys have adequate size and round in shape to fit the fingertips easily. Sturdy build quality synonymous with Logitech is evident in the product.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Suresh Chouksey",
		"reviewTitle": "It's Logitech and Logitech is the finest.",
		"reviewBody": "I have three of these and these are hands down, the best, be it for iPad or an Android device/Laptop. No questions with this. The value for money on top, well it's with most Logitech accessories so no surprises there. You can buy this in peace.",
		"reviewStars": 5
	},
	{
		"reviewerName": "DHIRAJ",
		"reviewTitle": "Very good for android and iOS",
		"reviewBody": "Very good for android and iOS, easy switch between 3 devices",
		"reviewStars": 5
	},
	{
		"reviewerName": "ABHISHEK NAYAK",
		"reviewTitle": "Happy customer",
		"reviewBody": "I don't use it properly but the quality is good in this price . Little heavy , packing is too good 👍 I buy it for my mi pad 5 but that product is still not delivered to me so I didn't check this keyboard properly  . Value for money ( go for it )",
		"reviewStars": 4
	},
	{
		"reviewerName": "Ashok",
		"reviewTitle": "Good keyboard",
		"reviewBody": "cool design, gives joy of typing. Very study.. loving it.Would have given 5 stars had they given the CAPS LOCK indicator. Else one of the best compact keyboards available.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Santosh",
		"reviewTitle": "Nice product but little costly ….!!",
		"reviewBody": "Wanted to get key board Bluetooth searched for my Mac , of all the option I choose this , I won't regret it . It's a good selection… but little pricier, worth it",
		"reviewStars": 4
	},
	{
		"reviewerName": "Rohit Yadav",
		"reviewTitle": "Very good keyboard with multiple devices connectivity",
		"reviewBody": "This review is going to be more biased on usage with Mac. At first, I was skeptical about buying this keyboard. But with newer MacBook's not having USB ports, I could not afford a 2.4Ghz unifying keyboard. After watching a lot of youtube videos, I thought of giving it a try. The keyboard works great with Macbook. With most of the general keyboards out there, I had a problem switching from Macbook's keyboard to a general keyboard due to the travel between keys like space & cmd. Mac users will understand the problem. This keyboard solves the problem and gives a very good and compact feel while working. Although have not used much till now. WIll edit the review after a month of usage.Let's talk about delivery: The Delivery person didn't even inform me that he is going. to drop the package at the main security gate of the apartment. I don't have any problem with going to the gate and getting the package. But the problem is I need to be informed. I collected the package at midnight when I saw the message from amazon that the package has been delivered.Packaging: Amazon packaging is always good. keyboard outer package was nicely packed and sealed. But the inner plastic in which the keyboard is wrapped feels a little cheap. You can check out the pictures.The keyboard does its job just fine and is very good. It is a little heavy for being a compact keyboard. But I don't mind that since I will not be taking it with me anywhere. So a little heavy keyboard which does its job is fine with me.The connectivity is great with Macbook and iPhone both. But on the iPhone, I am unable to type on most of the apps which are not from apple without enabling full keyboard access in accessibility mode. With system/apple applications the keyboard works very well.The connectivity is good and very fast. It just switches the connections real fast. The keyboard comes with 2 AAA batteries pre-installed, you just need to remove the thin paper sheet between the batteries and you are good to go.I hope this review is useful. I will be editing the review after a month of usage",
		"reviewStars": 4
	},
	{
		"reviewerName": "SUJIT MANDAL",
		"reviewTitle": "Feedback",
		"reviewBody": "Superb",
		"reviewStars": 5
	},
	{
		"reviewerName": "Dhiraj E.",
		"reviewTitle": "Portable Multiconnect Bluetooth Keyboard",
		"reviewBody": "Can connect multiple device and you can switch between any device with toggle switch. Its pretty heavy compared to tiny look do check weight description. Not best for people who are used to full size keyboard",
		"reviewStars": 5
	},
	{
		"reviewerName": "JebasRaja",
		"reviewTitle": "romba super for codeing",
		"reviewBody": "very very good product for laptop and other things",
		"reviewStars": 5
	},
	{
		"reviewerName": "Mukesh Krishnan",
		"reviewTitle": "Best Keyboard for Multi Device Connect",
		"reviewBody": "After using this after 5 months, I recommend this product who want to use single keyboard for Mac & Windows, also who usually travel often and want a handy keyboard while travelling.Pro's1. Bluetooth works fast as you imagine and you couldn't notice the delay.2. The Key are so good and you probably like the sound while you type.3. Can connect three device just toggling the switch.4. Design looks like preminum.5. Initial setup as easy both in Mac & Windows.Cons1. Some key / combination of key will not work as excepted but can be managed.2. Holder part in the keyboard are in bright colour will get dirt soon.Better:Battery can be last for more longer month, I got a range of 5 months.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Jatin Talwar",
		"reviewTitle": "Great product , Just wish there was a Hover pad",
		"reviewBody": "Very consistent performance. Hardware built quality is meeting the Logitech standards. Just a bit heavy . Connects with I pad , I phone and Android tablet and phone comfortably . 3 devices can be connected simultaneously via the selector switch .The keys are smooth to operate and gives you that classical mechanical keyboard feel. Size is fine for my fingers and should suit most .I just hope there was  Hover pad for the mouse . That would have really increased the functionality .",
		"reviewStars": 5
	},
	{
		"reviewerName": "Sanjoy",
		"reviewTitle": "Compact & Handy",
		"reviewBody": "The keyboard is really portable with stability. loved it.",
		"reviewStars": 5
	},
	{
		"reviewerName": "ANAND PATHANE",
		"reviewTitle": "Superb",
		"reviewBody": "Very handy",
		"reviewStars": 5
	},
	{
		"reviewerName": "MM",
		"reviewTitle": "Heavy with spongy keys.",
		"reviewBody": "I bought the product looking at the reviews here and the rating saw. Like a lot of people I went about a phase where I tried to convince myself that \"this is a great product, you are not typing right\". But after months of using it, I am ready to change it and get something that has more tactile keys and the feel is better.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Balasubramaniam",
		"reviewTitle": "Very Useful and light weight",
		"reviewBody": "Worth for Money",
		"reviewStars": 5
	},
	{
		"reviewerName": "Ryan Isaaks",
		"reviewTitle": "Good but bulky",
		"reviewBody": "A good bluetooth keyboard and can be considered. Could have been a bit slim",
		"reviewStars": 4
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "Great Product in budget",
		"reviewBody": "Really a great product, gives a feel of laptop in hand. A little heavy but who cares when you get such a great thing in 2.3k.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Kiran",
		"reviewTitle": "Product is good but not that much Portable",
		"reviewBody": "i am just satisficed with product quality",
		"reviewStars": 4
	},
	{
		"reviewerName": "Sajad Naikoo",
		"reviewTitle": "One of the Best Keyboards in Market i use it for my galaxy Tab S6",
		"reviewBody": "You can use it with any device like your I phone, Android phone Or tablet at the same time.",
		"reviewStars": 5
	},
	{
		"reviewerName": "PMPatel",
		"reviewTitle": "Multipurpose two device setting bluetooth keyboard",
		"reviewBody": "I tried it with mac and android operated device and both are working satisfactory.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Dhruv",
		"reviewTitle": "Good product at this price",
		"reviewBody": "Keys need some pressure to type correctly. Otherwise everything is fine.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "Good for portability but miss the laptop version of your key board",
		"reviewBody": "The product is portable and very stable. But you will not feel the same as your laptop keyboard. You feel some of the keys which you will miss especially the numpad . But if you want portability then you have to compromise in keys. I think the cost wise it is expensive..",
		"reviewStars": 3
	},
	{
		"reviewerName": "Mohammed Rahis",
		"reviewTitle": "Product is good but the delivery guys did not have change so that's what inconvenience.",
		"reviewBody": "Love the product. Recommend other to go for it",
		"reviewStars": 5
	},
	{
		"reviewerName": "Piyush Bhanushali",
		"reviewTitle": "Easy to carry",
		"reviewBody": "Quite portable, a little heavy though.  Best feature is that it gets easily paired with 3 different devices. Does not have inbuilt lithium battery.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "Heavy and makes lot of noise while typing",
		"reviewBody": "Heavy and makes noise while typing too small too",
		"reviewStars": 3
	},
	{
		"reviewerName": "Shivam L Srivastava",
		"reviewTitle": "This keyboard is not just a device, its an experience.",
		"reviewBody": "One keyboard and you can connect it to so many devices. It really makes your day. If you've got yourself an Apple or Samsung tablet, this will turn it into your laptop. This keyboard is not just a device, its an experience.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Rishabh Wadhwa",
		"reviewTitle": "Good keyboard",
		"reviewBody": "Work perfectly with my ipad & MacBook",
		"reviewStars": 5
	},
	{
		"reviewerName": "MAYANK HARSHVARDEN JAIN",
		"reviewTitle": "Unique and innovative with scope for improvement",
		"reviewBody": "I got it for ₹1999/- and at this price point it's worth the value. This keyboard employs a unique approach to ensure convenience of typing on tablets and phones which I'm sure most would like about this product. The pros and cons of this keyboard are as listed below:Pros:- Excellent at connectivity, the rotating switch easily manages transition between your devices.- Design and looks give a nice appearance. Though I got a black one but I guess white one would look more classy.- Functional keys are well provided for in the keyboard and they work with a charm on Android, iPadOS etc. I used my iPad and OnePlus phones on it and both are well compatible with its shortcut keys.Cons:- There is lag while typing although very less but you get a feel of it. Perhaps this is because it's completely based on Bluetooth and its BT version is not the latest one (neither is my iPad's. The lag is felt lesser in OnePlus)- The keys and other components do not give a very solid and sturdy feeling. Everything feels wobbly. Not much of an issue if you are going to place it on a table, but when carrying it in bag or holding on lap, you might get irritated a bit.I'm not taking the large weight (more than 800 grams) as a con because it's necessary to hold everything in place and the weight is not felt as much in reality as you would expect by looking at the figures. Plus, there is no lightweight alternative of this kind that we can compare with. The K380, for example, does not have the slot for holding tabs.Conclusion:If you are looking for a product that can turn your tablet in a kind of Netbook or Chromebook, this is worth a try. The good thing is even if you can't use it in the long run for your tab/mobile due to its weight it can anyway be used as a wireless keyboard for any PC that has Bluetooth. I bought this and Logitech Pebble mouse to explore what iPadOS can do with its mouse support feature and desktop like experience as Apple claims in ads. So far, the experience is good. You need to adapt a little bit when trying some make-do arrangements to get the laptop like feeling. Afterall, it's not that laptops and desktops provided everything great from the start but we feel compatible and comfortable with them because we gradually adopted their way of functioning and learnt intenralised their use as normal.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "Average keyboard",
		"reviewBody": "Dear users, Logitech k480 is a good choice if not the best. Connectivity and build is pretty robust. The only downside is the keys doesn't feel very soft and they feel like struggling while I'm typing.Well here i wanna specifically point out that I am a medium typeracer with wpm around 80-90.At this speed in my opinion the key travel is large. If you are not so much bothered about ultra High speed typing, I would say it's a good option.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Johnny Marshal",
		"reviewTitle": "It's a good laptop for Creators who constantly shifts between mac and PC",
		"reviewBody": "It is a really good keyboard with a sturdy mobile and tablet holder. It's bit bulky and heavier compared to other keyboard and doesn't have backlit feature but then it is durable and can withstand rough usage. The cons that I faced were the responsive of few keys were poor, but Logi tech have a really good customer support and I was able to get a new product with in no time. The keyboard has a wide and good key travel for an medium size hands, it also switches seamlessly from my Mac mini to windows laptop which is a really good trade for the amount I purchased during sale. On the whole it's a good keyboard if your working from home. Not suitable for travels.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Anonymous",
		"reviewTitle": "Good keyboard - but not for office/professional/serious use!",
		"reviewBody": "Have been using the Logitech K480 multidevice key board for the past couple of weeks. Here are my observations. There are some fundamental limitations with this keyboard but Logitech has priced the model which addresses these limitations way above… the Logitech MK850 Multi-Device Wireless Keyboard is three times more expensive and that price is a serious turn off! Anyways here is review of the K480.Pros:• It is an excellent “Basic” key board for multi device input. Basic being the operative/key word here.• Seamlessly links with even legacy laptops with older versions of Bluetooth.• The keys are tactile and though the rounded edges take a bit of time getting used to, they do a great job.• There is no lag whatsoever between keystroke and onscreen response.• Battery lasts if the user remembers to turn off the power button under the keyboard, and of course depends on the number of devices connected simultaneously.  The more the devices the faster the drain.• Sturdy, heavy and does not slip or move when typing fast or for sudden wrist adjustments.• Mobile device holder at the top is a good thought and is helpfulCons:• Seriously, seriously, very seriously miss the “Home” and “End” keys.• The dual command and opt keys on both sides of the space bar could have been optimized for other functions part of a standard keyboard layout.• The  F6, F7 and F8 function keys could have much better uses rather than music player and the F12 and lock keyboard buttons could be configured to “Home” and “End”Summary:This is not a writer's keyboard. it is for short quick use across devices. Definitely not recommend if you are planning to use it professionally. Save up your money and invest in the MK850 – as can be seen from the number of reviews, the device is way too expensive for a normal user. Still if you are looking to use a single keyboard and you do have multiple devices that you have to use professionally, go ahead and invest In the higher version.Would recommend if you are tired of typing with your thumbs on your phone/tab. And need something to handle your multiple devices when they are docked.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Mihir Gupta",
		"reviewTitle": "This is really made for table or bench",
		"reviewBody": "After 1 month of usage with my Ipad air, laptop and phone.Pros:1) This can fit a 11 inch ipad pro(Tested), don't know about 12.9 inch ipad or Tab S7+(Not Tested).2) The dial is mostly used for multi device pair and it is most convient if you have 2 or 3 device you are working at the same time.3) Buttons have a long travel and not squishy like a laptop. So you can get somewhat mechanical feel.4) Most buttons are really combined for windows, android, mac and ipad. So you have to take your time if you have multiple devices like me. Both Function and Multi-media.5) It will work with many platform: (NOTE: this is only a Bluetooth type and not a Wireless type that you found in mouse)a) Windows (Both PC and Laptop with Win 7 and above).b) Android (Like anything you can't even think of).c) Apple (Iphone, Ipad, Ipod and Mac OS[BT only]).d) Chrome OS and Linux Base Build (with BT support).Cons:1) It is heavy, well because you will keep a tab on the space so that you get the angle. when typing.2) It is Big(not much, it is smaller than my 15.6\" laptop's keyboard) and Thick(like put two phone on top with the case on).3) The button and light are on back, It's not a con but you will not know if you have a low battery in case you are outside on the office or at the college.4) NOTE: This is not a rechargeable battery type, it needs small battery to run(you get in the box).You can convert into rechargeable one just buy the battery pack and the battery holder or just put normal ones and you are good to go.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Gokul12",
		"reviewTitle": "Cheap keys, heavy keyboard but functional",
		"reviewBody": "It works - that is pretty much the most positive thing you can say. Beyond that - its heavy at almost a kilo so not portable. They keys are plasticky and require too much force. Also amazon does not offer a return policy so you will be stuck with this brick.",
		"reviewStars": 2
	},
	{
		"reviewerName": "Ganesh Nair",
		"reviewTitle": "a very good portable keyboard*",
		"reviewBody": "The typing experience is not as smooth as the K380, i would suggest to she'll our a few more hundreds and buy that if you have a longer typing deal. But it depends on how you type. If you are comfortable typing by lifting your fingers high from one key to the other, like how you type using a PC keyboard, or a mechanical keyboard, then this would not bother you. But if you are more comfortable with a laptop keyboard where you slide your fingers from  one key to another, then the K380 would be a better deal. I can manage because i use my stylus more than the keyboard, so the keyboard is majorly used while I travel or when I'm working on a document.One plus point for the K480 is the inbuilt stand. An iPad can easily dock into the slot and that is very helpful when you travel. The K380 would be useless here if you're using your tablet and the keyboard while in a car or sitting somewhere with no steady tabletop.Overall, this is a very good secondary keyboard, but if you plan to have a primary keyboard, then go for the K380. Or the Logitech keyboard cover if you can spend more...",
		"reviewStars": 3
	},
	{
		"reviewerName": "Esther",
		"reviewTitle": "Good portable keyboard",
		"reviewBody": "Writing this review after 3 months of use.I mostly use this to write research papers and take transcription notes. As somebody with a considerably good WPM typing speed, this is very handy. There are two cons for me though.The first (which may be an issue with my phone and not the keyboard) is the bluetooth connectivity to my phone is very unpredictable. Some days, it is smooth; other days, it will stutter and repeatedly write one single letter which can be hard to stop.Second, it is noisier than the average keyboard. Otherwise, it can work with transcription work (unlike another review I read here saying it's not good for that). There are no keys that get stuck. Only that it is noisier than normal.The batteries that were given with the device still powers it on after 3 months. Will write a review perhaps in another 3 months with an update.",
		"reviewStars": 5
	},
	{
		"reviewerName": "josh.always",
		"reviewTitle": "Good if only you need it.. but not necessary",
		"reviewBody": "I personally  felt its a fancy purchase, its useful to showoff lime 'yo, dude check this out it connects 3 devices at a time, man.' and put it somewhere you don't even bother to look at and use after a week. I thought of using more with 3 modes that given. its only good for typing and switching to 3 devices at the same time and type in them..cons: can't except all the shortcut functions like you get with pc or lap when you use it for tab or mobile.there are few functions overlapping while you using the shortcuts.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Shouvik Choudhury",
		"reviewTitle": "Ergonomic | Heavy | Rounded Keys | Compatible with Mac",
		"reviewBody": "Pros:1. My primary concern for buying an external keyboard was its compatibility with mac. This keyboard works with mac and windows equally well.2. Compatible with Android phones, iPhone and iPad as well3. It lets you connect to 3 devices. With the switch you can switch between which device to use. It works well.4. A big plus is there's no external bluetooth device to keep connected to the laptop. You can directly pair the keyboard with your devices. It makes this keyboard handy and easy to use.5. Ergonomic design with slot to keep your phone/tablet. Looks very nice!Cons:1. It's heavy! It's close to 800gms maybe which makes it a little bit harder to carry around.2. Keys are like typewriter keys. You have to hit with good force and depth. If you're coming from using a mac keyboard, it won't be a pleasant experience.3. Keys are rounded at the edges which reduces typing speed. Again if you were using a mac, it would put your finger placement off by 0.5mm maybe.4. Flimsy on/off switch5. No backlit keys6. No light to show if Caps lock is on7. Noisy",
		"reviewStars": 3
	},
	{
		"reviewerName": "Anshika Girdhar",
		"reviewTitle": "Value of Money",
		"reviewBody": "Material GoodProfomance GoodControl GoodConnectivity Good",
		"reviewStars": 5
	},
	{
		"reviewerName": "Doctor",
		"reviewTitle": "Worth buying",
		"reviewBody": "Good quality product. I converted my tab into a mini laptop. Great for travelling.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Manmohan",
		"reviewTitle": "It's good for portable but keys are very hard to press",
		"reviewBody": "in this range it's good product to buy for normal typing or normal work.but if you are programmer or typist then it's not for you. the keys are very hard to press.not good for speedy work.",
		"reviewStars": 2
	},
	{
		"reviewerName": "Milind Nagarmath",
		"reviewTitle": "Wonderfull Product - Just a bit too Heavy",
		"reviewBody": "It is a wonderful product. I am able use it with my tab and works flawlessly. The only thing about the product is it is quite heavy. For example it is heavier then my tab.",
		"reviewStars": 4
	},
	{
		"reviewerName": "SUMANPREET",
		"reviewTitle": "Perfect but little heavy",
		"reviewBody": "This product is good but it's weight is same as laptop",
		"reviewStars": 4
	},
	{
		"reviewerName": "Akansha jaiswal",
		"reviewTitle": "I'm very happy after using the this keyboard :)",
		"reviewBody": "It's a best keyboard I have ever bought :-)",
		"reviewStars": 5
	},
	{
		"reviewerName": "Harish",
		"reviewTitle": "It could be done better it it ha caps lock led light",
		"reviewBody": "No caps lock light",
		"reviewStars": 5
	},
	{
		"reviewerName": "Adrien",
		"reviewTitle": "Great Keyboard* With a few Shortcomings.",
		"reviewBody": "Ok, so I'm not going to format this review like an Official Email, but here are my Thoughts and Experiences I had with the Logitech K480 Bluetooth multi- device Keyboard.On first Impression, the Product was packed properly and Safely. the Box was high quality.Taking the keyboard out, I realized the weight is out of the roof. This thing feels like it weighs a couple Kilos!Setup was quite easy, I set it up With my Mac mini (Late 2012) and it easily paired. I've tested with Windows, Android, iOS and iPad OS and it seems to work perfectly.The Typing experience needed some getting used to. Previously I was using an Apple Magic Keyboard (Which got Water Damaged) and it was quite refreshing to use a keyboard with some actual TRAVEL. unlike Apple's Pathetic Keyboards.The main Reason I chose the Logitech K480 is that it has the Mac and Windows Key layout (Which is helpful because I use Bootcamp on my Mac to Play Games on Windows). Almost all keyboards in this price range only support the Windows Key Layout (Which is frustrating because as a Content creator who does his work 90% of the time in MacOS)I personally did not use the K480 for its multi device features, but only as a good desktop keyboard.Cons:1) The Keyboard is Extremely Heavy! (Because it needs to support a tablet on the Cubby Hole)2)The Keys are Very LOUD, coming from an Apple Magic keyboard.3)No Extendable feet on the front for comfortable Typing.So at the end the Logitech K480 is a great Bluetooth keyboard for any Desktop or tablet user. Go for it if the above info Match or Fit You. Thank you for your time reading my Review!",
		"reviewStars": 4
	},
	{
		"reviewerName": "Anoop",
		"reviewTitle": "Greate keyboard for an android device",
		"reviewBody": "This keyboard has got some really good functionalities which I didn't see in many of the portable keyboards in this price range.Pros:1. Easy Switch Dial to switch devices works perfectly. It's always better to have a separate key to switch devices rather than putting on top of function keys.2. Lots of  shortcuts options for android devices in the keyboard which helps to use the keyboard with minimal mouse/touchscreen.3. Keyboard has a good weight to it which helps to hold even the biggest of the tablets in the integrated cradle. Also it is easy to type on your lap.Cons:1. Weight could be a problem for some if the plan is to use this as a portable device.2. Its not an ideal keyboard for Programmers. All the function keys are shortcuts to use for android. Because of this you have to click the Fn Switch to activate the Function Keys. There is no option to permanently turn on Fn Key. This could sometimes be annoying. Also the arrow keys are smaller.3. I'm being nit-picky here. If you are a person who use gaming/mechanical keyboard will find keys a bit shallow which could cause pain to your finger while touch typing. To be fair, all the portable keyboards I tried has the same problem (except for surface keyboards).4. Don't have the wireless connection capability. Only Bluetooth. You have to buy a bluetooth adapter if you want to connect this to your pc.Overall a great keyboard for your android devices.",
		"reviewStars": 4
	},
	{
		"reviewerName": "PRASHANT",
		"reviewTitle": "Handy multipurpose product",
		"reviewBody": "Product is very handy and good for multiple devices",
		"reviewStars": 4
	},
	{
		"reviewerName": "Sravan kumar",
		"reviewTitle": "Good for switching between devices",
		"reviewBody": "Go for this if you are working parallelly",
		"reviewStars": 5
	},
	{
		"reviewerName": "Nascent",
		"reviewTitle": "Read before you buy",
		"reviewBody": "It's a nice keyboard to have specifically if you have an ipad. If you want to buy the keyboard for writing long emails or you really want to work really fast this one isn't for you. You really have to press the key significantly to type effectively.  When I work fast I tend to lose few alphabets due to not pressing key significantly.  Typing experience is not very smooth, sound of typing might disturb people around you. Built quality looks fine, it connects easily.FYI- my friend really like this and had no problem whatsoever while typing at any speed, he said he likes it the way it is. He said he didn't accidentally typed any extra alphabet when he used it unlike other keyboards that types with the feather touch,If you're like my friend you really should go for it.",
		"reviewStars": 4
	},
	{
		"reviewerName": "D Singh",
		"reviewTitle": "Awesome Keyboard",
		"reviewBody": "I love it, it helped me alot in my travel and now in daily use. A1 quality",
		"reviewStars": 5
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "A fantastic piece of equipment indeed!",
		"reviewBody": "I'm very finicky about my likes and dislikes. I love my HP Elitebook completely, but lately, it was getting a bit hot in the keyboard/touchpad area and I was uncomfortable using it as much as I do. First, I bought a regular chiclet keyboard from Dell, it was ok but in a few months, I noticed that due to the lightweight nature of the keyboard and it's elements it was becoming harder to type at a reasonable pace. The keys didn't go all the way down unless I was pressing them straight down, ended up having to move my hand quite a bit to make that happen. It became tiresome.Then I did some research and found this great blog which introduced me to all the terms attributed to the performance of a keyboard and I was able to search better for what I wanted. Found this keyboard last week and sat thinking on it for 4-5 days considering the price point.Ordered on the night of 6th, was delivered before breakfast on the 7th. (Perks of living in Bengaluru, I get most of orders delivered like this.)You will love it as soon as you see it. Heavier than you'd think but it is necessary to hold the weight of a large tablet in the cradle. Connected without a hiccup to my Samsung Note 9, HP Elitebook and Samsung Frame in seconds. The dial is great, switches over instantly.Don't forget to install the Logitech Options software on your laptop/computer, it will allow you to default the function keys and set some shortcuts to the multimedia keys if you choose so.Read the complete manual on the Logitech website to understand all the great features you get on this keyboard.Lastly, 1 small con - the travel is a bit long on the keypress but a lot less than a regular keyboard. I'll get used to it.Verdict: Buy it.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Arunangshu Sen",
		"reviewTitle": "overall good keyboard.",
		"reviewBody": "If you are a casual gamer then you need a mechanical switch. but this is an overall good keyboard.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Kindle Customer",
		"reviewTitle": "Good",
		"reviewBody": "Easy on fingers, connects quickly, excellent product.",
		"reviewStars": 5
	},
	{
		"reviewerName": "R Senthil Kumar",
		"reviewTitle": "Cute & portable",
		"reviewBody": "Fine product of Logitech. Unique product with mobile/tablet holder. Serves both my Surface X Pro & mac devices.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Saurabh vashisht",
		"reviewTitle": "A bit heavier than I expected.",
		"reviewBody": "I will have to carry a bag if I am taking it with me anywhere.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Bala",
		"reviewTitle": "Good",
		"reviewBody": "The key board is good in general, but I feel few things are yet to improve, they shuld also provide a dongle along with Bluetooth connectivity, like the mouse pebble from logitech. Connectivity has minor latency while typing, you cannot see the wordsInstantly when you type, switching between device as well has latecy. I in general use only for my laptop, so I gave initial hiccup to connect later is fine, otherwise, the provision to hold mobile, ipad, etc is very useful, Design is good and sleek over all a good product",
		"reviewStars": 4
	},
	{
		"reviewerName": "Shagun Thapliyal",
		"reviewTitle": "Good product",
		"reviewBody": "Strong robust product",
		"reviewStars": 5
	},
	{
		"reviewerName": "Balraj Singh Virk",
		"reviewTitle": "Good product but could have been better",
		"reviewBody": "My first impression after using it for a while👍🏻 PROS -• Built quality is good but not excellent which i was expecting.• Option to put your smartphone as well as a tablet together is a great feature.• Place where ur device can stand is fully rubberised which make it scratch resistant for both the devices.• Keys are comfortable enough to type.• There is enough space between the placing of  keys which hell in preventing any accidental key press.• Keys feels little mushy press but also enough clicky as well.• The Function keys both top and bottom has an oval shape coming outside andThe rest of the keys are oval from inside which hells in making difference between those keys a lot.• Enter keys, back keys and shift keys sounds different while pressing.• Lettering on the keys are bright enough in the black color keyboard.• Keyboard is bluetooth powered which gives more accessibility to be supported by many other bluetooth supported devices.• Three devices support than can be switch between in an instant using a dialer provided.• Keyboard got to buttons dedicated in order to connect to either windows or chrome powered devices and one button for ios or mac powered devices.• Keyboard which comes in black looks very good.• Overall finishing of the product is very good.• Keyboard is very light weight as result long term typing while keeping it on ur lap won't make u feel any fatigues.• There are also keys through which u can take mobile or tablet screen shot with one click and menu key, app switcher key, and home key, search key, back key, volume keys and for emoji key (F12) as well as well which help in ease the use for tablets and smartphones.• Range is enough.• Batteries are included as well but not Duracell.😢• Its Does have notifications Blue color LED👎🏻 CONS -• No led Indication for the caps lock.• Plastic is sturdy but can be chip off if slips of or falls on the ground so better take care of it.• U Can't play games on smartphone devices and tablet using the keyboard, ios for sure but android may be or may not be but with the help of some third party apps on android we can.• No Bluetooth dongle is provided.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Karthik B.",
		"reviewTitle": "Good",
		"reviewBody": "Some flex but overall good",
		"reviewStars": 5
	},
	{
		"reviewerName": "Attra",
		"reviewTitle": "Great functionality.",
		"reviewBody": "It's a great functional keyboard, i am typing this review from this keyboard only.  If you use an iPad but want something that can work with your phone and computer as well, definitely go for this instead of the magic keyboard,It works on all devices at once has great key travel and won't break the bank. It's heavier than you might think although that is alright since it has to counter the torque of devices in the slot. The slot is great for holding devices and holds the devices firmly because of its depth and rubberised interior which provides more than enough friction to hold them.Multiple connectivity at once and the ease of switching is a great advantage that this keyboard has over the other Bluetooth keyboards. It has both MacOS and Windows shortcuts mentioned so that helps if you haven't used the iPad with a keyboard before. There is a small learning curve as there are a lot of keyboard shortcuts to be learned..but that wont take more a than hour to learn.The key quality is okay as it is made a plastic..so not the best keys but good at this price point.The longevity is something that I don't have a lot of idea about as I haven't spent a lot of time with is..however since it is a Logitech product i think it will be fine for a long time.Definitely buy the black version as the white one is more likely to get dirty.A big problem with this that this has no backlit keyboard. If it did this would be an easy recommendation.",
		"reviewStars": 5
	},
	{
		"reviewerName": "mustang",
		"reviewTitle": "keyboard is not ergonomical",
		"reviewBody": "I purchased this keyboard so that sometime I could replace my work from Laptop to tablet+this keyboard. To my surprise the keyboard is heavy which is okay but typing with it is really not comfortable. Even cheap keyboards are ergonomic than this. I think Logitech could do better.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Deb",
		"reviewTitle": "Value for money.",
		"reviewBody": "Multitasking. Easy connect. Easy switch. Convenient. Perfect size. Easy to carry.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Punit kujur",
		"reviewTitle": "Best product for this budget",
		"reviewBody": "Beautifully designed keys they r soft, tactile and responsive.. key travel is less so typing speed inherently increases with this keyboard... If someone is looking for 100% portable keyboard.... Then i would say it maybe not the best one out there.... Because of the size and the weight as compared to Logitech k380 .... Go for that one if portability is your priority ... Otherwise this is the best one...",
		"reviewStars": 5
	},
	{
		"reviewerName": "PJ Menon",
		"reviewTitle": "Don't know",
		"reviewBody": "I don't think it has more utility than it's online keyboard",
		"reviewStars": 4
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "DOES WHAT IT SAYS! Worth Buying!",
		"reviewBody": "This is one of those products that deliver exactly what it promises. No unpleasant surprises here!If you need a single keyboard to go along with multiple devices and one that doesn't need to be connected via a USB dongle then this is it.Especially if you need a keybooard for your ipad- This is excellent.The only thing that I didn't expect is the weight. It is heavier than i had expected it to be however it is definitely not a deal breaker. In fact it makes it feel more sturdy and long lasting.The other issue I could point out as a minor negative is that the keys require a little extra force to be pushed down while typing. Maybe i am just used to my macbook pro and a wireless Amkette super light keyed keyboard but that is definitely something that I noticed instantly.Once in a while I hit a button and move forward with my sentence only to realise I have to go back and type one of the alphabets again.This is also in my opinion not a deal breaker but takes some getting used to.To conclude- I would highly reccommend this keyboard!! Quality of material and build is top notch! In comparison to other keyboards on the market, this price makes it real value for money.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Srinivas C",
		"reviewTitle": "Useless Product",
		"reviewBody": "Used for 10 minutes..Afterwards it's not working..Useless Product..Don't be cheated.",
		"reviewStars": 5
	},
	{
		"reviewerName": "HARI PRAKASH SHARMA",
		"reviewTitle": "Good product.",
		"reviewBody": "Good product and easy to connect.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Roopam Gupta",
		"reviewTitle": "Superb value for money spent ....",
		"reviewBody": "Second day with the product. Can review as belowPROS -1. Sturdy keys. Gives the feeling of old desktop keyboards. Can work very fast, especially when my usual typing skills are very poor.2. Can connect to iPad, Dell PC, Apple MacBook Air or iPhone (any three) at one time simultaneously, choosing through the dial to work with the preferred one through the keyboard.3. Very stable and ergonomic. I could work for hours on a stretch albeit with small breaks in between, while working on my thesis, and didn't feel soreness of fingers.4. A superb value for money (as titled too) .... great possession at this price indeedI am writing this review when I have extensively used other Logitech keyboards, Apple keyboard, HP and other integrated ones from almost all brands int he past two decades.CONS -1. Only CONS I can find is that no keyboard skin or cover is available at Amazon or other platforms and with a 7 yo kid at home, there is always a fear of water spillage etc. as in past.2. Some would review it as 'too heavy' but my request is to patiently use this one for few days, for continuous typing of 30m or so, and you shall certainly fall in love with this one, especially if your typing skills are like mine - poor to average.Planning to buy one more of this for my daughter to use with her iMAC 4K, for 3 to 4 hours long online classes in current COVID times as she is somehow not comfortable (strangely though) with her Apple magic keyboard.Shall again review/update after a month or so of use .....",
		"reviewStars": 5
	},
	{
		"reviewerName": "Jhankar Niyogi",
		"reviewTitle": "Typing is a soft touch experience.",
		"reviewBody": "Writing the review with the same Keyboard. I purchased it to turn my Samsung S6 lite into a mini PC (after the roll-up of DEX support, it has become one). But now, I am using it with everything I type, whether it is a WA message or Kindle Book review on Goodreads or Instagram, or while surfing the web even through my laptop. After going through tones of reviews of this piece, the only thing I found crap in those, was the typing experience. Many reviews do say that the typing ex is not that good and the keys are hard and all. But I have an ex of Mechanical Keyboard, Laptop keyboard, Med range membrane keyboard, and apple's keyboard. But trust me, even if, I would have all of them in one place, I will pick up this (Period). Though it is a Lil bit on the bigger and heftier side, which I think because of the supplementary mobile and Tablet holder, after using it, I can think of the privileges, I had been truncated from, all these years while using all those keyboards. The Holder is just an amazing workman in this whole typing system. And talking about the connectivity, it is the one feature, one would use the most. If I would have to propose anything, then that would be, if you are living somewhere, the surroundings are polluted with dust or something like that, then don't buy the White one. I did the same paranoid stuff even when I live in the coal mining area.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Neeraj",
		"reviewTitle": "Good",
		"reviewBody": "Good",
		"reviewStars": 5
	},
	{
		"reviewerName": "Vishwanatha T",
		"reviewTitle": "Excellent product",
		"reviewBody": "I am really impressed with the product and its features. I purchased this with a specific purpose. As a tourist, I did not wanted to carry my laptop for my social work activities, like typing and pasting contents. Instead, I connected this blue tooth key pad with my smart phone and I could edit and paste word docx contents using Note Pad of my Android Phone. This works very well with the Smartphone. Its installation is very easy and two options are provided - Andriod or Apple phone. Very handy, no change in key pad keys. Good product to own and carry. You can connect this to any gadget with Blue Tooth in it.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Shubham Rastogi",
		"reviewTitle": "Great keyboard",
		"reviewBody": "Can pair upto 3 devices , easy to pair and switch among the same. Good tactic feedback, not for silent typing lovers, people who like the sound of clicking will enjoy it. Works flawlessly for my android tablet, also use it for PC and phone. Compaticle with both IOS and Android with dedicated pairing buttons. Easy to carry, has a power button at the back to turn on and off. On a bit heavier side but thats not much of an issue. Not suitable for full fledged gaming.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Raul",
		"reviewTitle": "Good quality but there are scope for improvements",
		"reviewBody": "Excellent product, easy to pair and fairly ergonomic, although was surprised at the weight. It had a lag when i pressed the alt key in Windows OS. I use it across 2 windows laptops and one iPad and for three devices. The keys are good, not excellent.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Ashok",
		"reviewTitle": "Good and Bad",
		"reviewBody": "Good:It's looking goodPair quickly with both iPad and windows laptop or android phone.Bad:Its heavy,This keyboard is as heavy as my laptop, I think it's designed that way to hold the iPad not to flipNo silentTyping experience, noise like old day, kind of liking the sound thoughMissing home and end button, alternative available.Need to apply little prusure on keys, not smooth as laptop keys.No additional height adjustable available at back..",
		"reviewStars": 4
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "Item features to support android, MS, IOS efficiently",
		"reviewBody": "More improvements like size of the item, keys stroke movement",
		"reviewStars": 5
	},
	{
		"reviewerName": "Manu Prasad",
		"reviewTitle": "Good Quality product value for money",
		"reviewBody": "If you are used to normal key board it will take some time to get used to this. Mostly like a mac key board and there is no number pad on the right hand side and no enter key on right. Bit difficult to get used to this.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Xeta",
		"reviewTitle": "Simple and Awesome",
		"reviewBody": "I am using this keyboard since 30th March , 2021 and very much satisfied.I am using it most of the time with my laptop (90%) and some time with my tablet (only 10%)ProsPortability and great build qualityIf you like key press sound(just like TVS Gold) it is for youVery functional and very fast to connect the deviceCompatible for Mac, Android, windows with 3 device switch with easy dialerIntegrated cradle to hold tablet (upto 11 inch) and smartphoneConsNo back-lit whileIn case of in built track pad it will do betterQuite heavy",
		"reviewStars": 4
	},
	{
		"reviewerName": "harsh",
		"reviewTitle": "Love it.....just gives old typewriter vibes in new format",
		"reviewBody": "Its really great in terms of connectivity..its a bit heavy that can make it difficult to carry around but size is quit decent to fit in a bad pack...keys are solid strong and its fun typing ..if you like old keyboard feel like I do",
		"reviewStars": 4
	},
	{
		"reviewerName": "Saravanan",
		"reviewTitle": "Ease of use with multi device simultaneously",
		"reviewBody": "After years of usage, it still feels good. Just heavy so less portability. But on a table its nice and firm - good grip. Even when not actually using the keys it serves as a stand for tablet / phone to watch movies. Keys get stuck over usage, but over all a decent investment.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Amazon user",
		"reviewTitle": "It's like having 3 devices easily typing up with just 1 logitech keyboard !!",
		"reviewBody": "Great experience. It's been a month. Efficiency is rapid while typing such a good product must have for those who uses technology and typing mostly.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Narayanan",
		"reviewTitle": "Logitech K480. Not getting connected with pc and tab. No instructions",
		"reviewBody": "Dislike. Waste of money",
		"reviewStars": 2
	},
	{
		"reviewerName": "Sanam Purohit",
		"reviewTitle": "Best Bluetooth Keyboard for Tab's & Phones",
		"reviewBody": "Probably the best bluetooth (separate) keyboard for tablets, phones etc.Pro's -1. Very Easy and Quick to configure and Pair (Easy to follow instructions are pasted on the top part of the keyboard so dont even need any manual)2. Can pair 3 devices at any time.3. Sturdy and good build quality.4. Slot on top of the keyboard to keep the phone or Tab in while typing.5. Duracell AAA battery included.6. Relatively compact dimensions.7. Device keyboard doesnt pop-up and thus you get to type while viewing the whole screen, unlike the partially covered screen when the device keyboard pop's-up. I use it for my 8 inch Tab and my phone (both Android). The best part is when you place your Tab in Landscape mode in the slot given on the keyboard it almost feels like you're using a small laptop.Con's -To be honest I couldn't find any specific problems, but if I had name a few then -1. Keyboard not backlit. (With this feature, it would have definitely been just perfect).2. I agree with other reviewer's that the weight is more than any other keyboard but that's mostly to do with balancing it when you place the tab or phone in the slot.I checked for better reference for others, the slot on the top can accommodate a Tab in landscape mode with the longer side measuring upto 10.5 inches.I almost bought a new laptop but kept going back to reading more about this keyboard and finally I'm so glad I bought this instead. Got it for a great price during an offer too.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Onlyme",
		"reviewTitle": "Ok ok",
		"reviewBody": "Ok ik",
		"reviewStars": 3
	},
	{
		"reviewerName": "आशीष मिश्रा (सीब्बू)",
		"reviewTitle": "Jhakkas",
		"reviewBody": "Mast Keyboard Hai Nice.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Aman Kumar",
		"reviewTitle": "Good but little heavy! Jack of all trades, perfect for none!!",
		"reviewBody": "Worth it if you work on multiple machines simultaneously.Not very portable. Good for desk.Keys are a little harder to push. I never miss any taps but you need to get in the habit of it.Don't waste your money if you think it'll help you switch to and use your phone. Not a good experience on Samsung UI. WhatsApp is also not designed properly to work with keyboard.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Prateeksha",
		"reviewTitle": "Good product",
		"reviewBody": "A compact, portable and multi functional keyboard. Only qualm is unavailability of separate home and end button that I really miss, otherwise a great product.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Raghava",
		"reviewTitle": "Very good",
		"reviewBody": "Very good",
		"reviewStars": 5
	},
	{
		"reviewerName": "Raj",
		"reviewTitle": "Best Bluetooth Keyboard",
		"reviewBody": "Pros:- I have been using a Cooler Master mechanical keyboard for years and was concerned that the Logitech keyboard might not be as comfortable to use but the keyboard is really comfortable to use and without a doubt the best non-mechanical keyboard I have used so far.- Battery life is great, I use Duracell rechargeable batteries and I use the keyboard for 30+ hours every week and the battery easily lasts for 1 - 2 months.- Looks really good. The best bluetooth keyboard design I have seen so far.- Easily connects with devices, just have to press any key and it instantly connects with the paired device.- Can easily switch between multiple paired devices.- No need to power off the keyboard manually to save battery, it automatically turns off after about 30 minutes of idle time and just have to press any key to power it on again and it connects instantly.- The cradle firmly holds tablets and mobiles.Cons:- Keyboards are not backlit, so not comfortable to use in dark.- Doesn't have a stand so can't use the keyboard in angled position.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Bosco D'souza",
		"reviewTitle": "Ergonomic Bluetooth keyboard",
		"reviewBody": "Alright, The Logitech K480 , in my opinion is for commercial purposes only, say you work a desk job, that's what it suits best for.If you're looking out for a keyboard that assists in typing on your Tablet PC / phone, here's the perfect model, that tackles the issue of needing a wireless dongle for connectivity.Else, if you're looking for a gaming wireless keyboard, I'd rather suggest you go for one that is built for gaming, definitely not this one, since, the keyboard layout is that of a MacBook's and to add to that , the key shape, distance between Adjacent keys, key press duration and feel is that of a typewriter!Lastly, this keyboard definitely did not disappoint in terms of its connectivity, portability & design . However, I personally expected a little more efficiency in terms of the typing speed.That's all.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "Good, sturdy, heavy so devices remain stable in it",
		"reviewBody": "The keyboard is heavy hence even heavy tablets don't get toppled, they remain stable in it. Keys feels like mechanical but feels good.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Bla",
		"reviewTitle": "Good product as of now. Just got it.  Looks super cool.",
		"reviewBody": "Product is good as of now. Looks super classy too. Wait for an offer or discount to buy this keyboard. The price does drop to less the 2k. Just like today. Now i wish i waited for few more days",
		"reviewStars": 5
	},
	{
		"reviewerName": "Kishan",
		"reviewTitle": "Usless",
		"reviewBody": "Keyboard is not working sometime",
		"reviewStars": 2
	},
	{
		"reviewerName": "Sushrut Sathy",
		"reviewTitle": "Flexibility",
		"reviewBody": "Have been using the keyboard to work with 2 Android tablets and 1 apple, feels like a charm in switching between devices during work would recommend the gadget if you need a good keyboard for medium computing on your tabs, it would feel like you have a mini laptop",
		"reviewStars": 5
	},
	{
		"reviewerName": "Rajiv Gupta",
		"reviewTitle": "Good but bulky",
		"reviewBody": "Overall weight of product. It's heavy.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Arghya Chakraborty",
		"reviewTitle": "A Great Value for Money Keyboard",
		"reviewBody": "Logitech makes great products, be it mice or speakers (and everything in between) and this K480 keyboard is no exception. Here's my review ~1. Looks wise this is pleasing. Black and lemon yellow combo is stunning. (10/10)2. Not much heavy and should be easy to carry around in your regular laptop bags. (8/10)3. Bluetooth pairing is as easy as it gets. (9.5/10)4. Very easy to type, button placement is good as compared to others. However, bear in mind the switches are NOT backlit and they make a little noise while typing, although not as much as some youtubers might make you think. (8/10)I use my iPad 2018 and my android mobile side by side with ease. So, this should be a good addition to your gadget list. Hope this helps.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Cyril Varkey",
		"reviewTitle": "Good keyboard",
		"reviewBody": "Nice quality product",
		"reviewStars": 5
	},
	{
		"reviewerName": "swaroop",
		"reviewTitle": "Worth it",
		"reviewBody": "Looks descent, lil pricy but has modes for mac os, windows, chrome os. Its imp feature for me being programmer to use ubuntu and windows both.Main diff between this one and other wireless keyboard is bluetooth connectivity.It enables typing on mobiles, tabs as well. No need of usb adapter that we normally need to plug into laptop.Con: no led light to denote if caps is on or not. Very basic ux feature is missed. Also, I am missing home and end keys which are useful while programming.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Zohaib",
		"reviewTitle": "Multi-device, makes noise",
		"reviewBody": "The keyboard is fine n it's main feature is multi device connectivity however, it's makes too much noise and missing home and End keys.If it's not a concern, go for it as it's Logitech.",
		"reviewStars": 4
	},
	{
		"reviewerName": "y v saimadhav",
		"reviewTitle": "Good with few cons",
		"reviewBody": "I am using it with my Mac Mini and the experience has been good. I have connected it with Android devices and also with iPad. Connectivity has never been a problem. The keys require some force. But for me , the biggest con is the lack of a notification light for the CAPS lock.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Amazon User",
		"reviewTitle": "Recommend for multi device sply if you have tablets",
		"reviewBody": "A very useful product. I'm using it with my laptop (win 10) and ipad air 3. It does not need any dongle to connect to devices.Typing is very comfortable.I love the switching between the devices with a dial. It switches and connects to pre-paired device within 1-2 seconds.Pairing was very easy. It stores the last paired device on the rotatory dial.The angle of visibility on ipad with cover is also pretty descent. Most of the mac os shortcuts work on it.I comes with 2 AAA duracell batteries pre fitted.Cons:No indication for caps on/off - this is an issue while putting password on lock screen of pc/laptopIts bit heavy and bulky to carry it around with your laptop or ipad.No backlit keys, so typing is difficult with room lights off.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Sakshi kukreti",
		"reviewTitle": "Amazing, haven't assumed as it is , its fabulous",
		"reviewBody": "",
		"reviewStars": 5
	},
	{
		"reviewerName": "Shashank K",
		"reviewTitle": "Nearly Perfect",
		"reviewBody": "+ High build quality+ Reliable technology+ Media keys are a blessing+ Price justified+ Logitech- It's very, very heavy so it can keep the tablet in place.- Would have been perfect with a touchpad for added functionality.Four stars as it's definitely not a full keyboard replacement by any means. Chiclet keys are uncomfortable to use compared to a normal membrane keyboard. But if you will be writing on a tablet/phone, this is perfect if you can't use a full keyboard for some reason.This is a secondary keyboard for people who need to type on tablets or mobiles. Useful and fun gadget, but it's only a gadget.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Reader",
		"reviewTitle": "Good device",
		"reviewBody": "Giving 4 stars because to my taste, the keys are a little hard to tap.I've been an avid laptop user and recently when I had to choose if I should go for ipad or a new laptop, I decided let's try ipad. I mostly use laptop for Microsoft tools, surfing, watching movies and for that ipad was handy. And so came the question of getting a Bluetooth keyboard. The k480 has the premium look and amazing functionality, especially the functionality of toggling between 3 devices seamlessly. But the keyboard indeed is bulky and not very feasible to travel with. The keys are a little hard to press but you get a hang of it after a while.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Dibyendu G.",
		"reviewTitle": "Very nice product",
		"reviewBody": "Very nice keyboard but weight is on the heavier side and no backlight which you can not expect in this price range. Which is absolutely okay. And according to my requirement its best buy. Very nice product.",
		"reviewStars": 5
	},
	{
		"reviewerName": "SM",
		"reviewTitle": "Good but with some cons, not a deal breaker",
		"reviewBody": "Have been using it for last 1 yearPros:1. The keyboard is compact2. You can put your tab/phone on the front slot3. Didn't see the need to change the cells since last 1 year4. Connects very quickly with the selected devices5. Looks great6. There are dedicated function keys which can function very well with your phone/tab/pc and you can customize using the Logitech's PC application.Cons:1. Slightly heavy, maybe to balance a tablet if its put into the front slot2. Keys are very noisy, no backlight3. Build quality (the plastic) is not so great. It makes squeaky sounds when held in hand or if the body plastic is pressed.4. The power button for the keyboard should had been on the top instead of at the bottom.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Sahil",
		"reviewTitle": "Useful when working with multiple devices.",
		"reviewBody": "After usage of 6 months:- Still works and looks as it's newly bought.- Using the same battery till now which was provided with the packaging. (Remaining above 50%)- Connects and works very well with Mac, Windows, Android. (Not tried with an iPhone/iPad)- A little bit heavy around 750g but not a problem if you don't need to travel.- Not a cons: (Probably issue with my windows laptop Bluetooth connection)  --> It sometimes (very rarely) doesn't work properly with my windows but I am sure it's the issue with my Windows laptop Bluetooth drivers and not the keyboard.Able to adjust Mac brightness with ( fn + down/up arrow key ) but not windows brightness with this keyboard.  --> Let me know if there is a possible way for windows to adjust the brightness.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "Personal favourite",
		"reviewBody": "I have worked on different types of membrane keyboards, including ergonomic ones. This one stands out due to it's click and solid feel on typing. Weight is on higher side, this helps keyboard to stay firm and stable even with smartphone and tablet placed into holder. Connectivity options are big plus when working across different devices.",
		"reviewStars": 4
	},
	{
		"reviewerName": "M. Kulkarni",
		"reviewTitle": "Works well but is heavy",
		"reviewBody": "Works will with 3 different iOS as well as android devices simultaneously. But it's very heavy (heavier than some of the light weight laptops!). So not suitable for travel. There is a slot to keep tablets or phones, but I found it not ideal for iPad air. It fell down a few of the times, but if you have separate stand for iPad or flip cover, then it works well with the keyboard.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Amazon Customer since 2006",
		"reviewTitle": "Good keyboard. Performance issues with Apple devices",
		"reviewBody": "For a compact working space & multi-device needs, this is the best device in this price range. However, there are issues with Apple devices where it sometimes works and sometimes just doesn't work. Not sure if the updated iOS versions are to blame.Feature wise, the keyboard performs satisfactorily, keys are well laid out and with good travel.You won't miss the numeric keypad unless you're addicted to it and the weight makes it reliable to place your tablets in the slot without worrying of tumbling accidents while using it on your lap.",
		"reviewStars": 4
	},
	{
		"reviewerName": "sudheer",
		"reviewTitle": "Loving this!",
		"reviewBody": "I am loving this keyboard. Price is a little high and is reasonable w.r.t the quality of the product. Facing Bluetooth disconnectivity issues if I operate with three devices at a time though it is the feature of the product. Except this, the keyboard is a must-have and that to this WFH days!",
		"reviewStars": 4
	},
	{
		"reviewerName": "Richard Fernandes",
		"reviewTitle": "This keyboard meets the purpose.",
		"reviewBody": "It is good for multiple devices works with ios and windows. It meets the purpose and saves space and time. It is very good while using IPad and Windows Laptop quick and easy to toggle between devices. However you need to memorise the device the configuration for the keyboard. Will get used to it eventually.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Shyam Prasad Paleti",
		"reviewTitle": "Poort Battery Life",
		"reviewBody": "Battery Life is extremely poor. I bought the device on Nov 13 and today is Dec 5th. I have to replace the batteries. Note: I use the keyboard most of the day, as I am in software field.",
		"reviewStars": 1
	},
	{
		"reviewerName": "Prit#",
		"reviewTitle": "Cool",
		"reviewBody": "Product is good but keyboard back stand is not available otherwise all great to use.",
		"reviewStars": 4
	},
	{
		"reviewerName": "lokesh",
		"reviewTitle": "White Looks awesome!! Updated after 7Month usage.",
		"reviewBody": "Nice keyboard and is comfortable to use with multiple devices. i haven't noticed any delay when the keys are typed for general purpose activities. the only thing which could had improved is the accessibility of the power on/off button which is located at the backside and its not accessible easily without lifting the keyboard. most of the time i don't bother to turn it off when not in use as it has a sleep mode which conserves the battery when not in use.[Update]Never bothered to turn off keyboard after usage.Finally, got a notification on Ubuntu OS stating that battery is <10% and should be changed. Windows 10 didn't show battery low notification.Switching across devices is instantaneous.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Raghav",
		"reviewTitle": "Nice iPad companion!!",
		"reviewBody": "Got this keyboard after going through many reviews from tech review sites like wired,Engadget, and pcmag. Amzon india's parent firm Amazon USA also helped in the same.(nowhere the reviews are less than 80%).The keyboard has Bluetooth wireless connectivity which is one of the best I have seen. I also own a Logitech Bluetooth mouse(M557) which takes 1-2 seconds to connect, but this one is absolutely winning at that. You just turn it on and there it is ready to go!! For switching between devices you just need to turn the wheel and it jumps from one device to another like it was always connected to them.The keyboard might seem a bit loud to some but sure is sturdy and can withstand some wear and tear. The keyboard can rotate between three devices at a time irrespective of them being a windows, iOS, OS X or android. I have been using the keyboard for the past ten months and it still looks brand new(colour:black). If you absolutely need a keyboard with a cradle to hold device then go for it. Otherwise, looks for k380 another nice Bluetooth keyboard from Logitech at half the weight.Overall-Pros:(1)Nice rubber coating in the cradle to prevent your device from getting scratched(2)Fast and flawless connection(3)Keeps track of the device and type allotted to the each wheel position(4)Long battery life - 2 AAA batteries come pre-installed with the keyboard and can easily last 10-12 months(5)iPad Air 2nicely fits inside the cradle even with the smart case(might not be true for older thicker ipads)(6)Bluetooth - hence no hassle of keeping track of donglesCons:(1)A little heavy at 820gm, approximately double of k380 420gm(cradle-less cousin)(2)A title loud sometimes(3)Thinner devices may not fit well inside the stand, same goes for thick deviceNote for tablet users:A must buy it is !! Better than the flip keyboard covers both in quality and durability. You can put your tablet inside the cosy rubber place and use it like a laptop(unlike keyboard covers which need hard surface)If you own an iPad, you may not be turning on your mac/PC for quite some time as it makes for a perfect companion to iPad. iPad Air 2 + k480 weigh around 1200 gm, are easy to carry in backpack.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Pradeep kumar T S",
		"reviewTitle": "Best Keyboard ever",
		"reviewBody": "I have been using this keyboard since Jan 2019 and till this day it works fine. It can connect unto three computers. I use it for my Mac mini M1, iPad and my Dell laptop. the battery comes more than a year. Till these days, I have changed battery only twice. Even after 3 years, still this product is in stock, Good to go... The weight of the Keyboard is high to withstand the keystrokes..",
		"reviewStars": 5
	},
	{
		"reviewerName": "SHARATH K",
		"reviewTitle": "Good product .. but ....",
		"reviewBody": "A very good product indeed .. connects well .. seamless .. keys are smoothThe only issue is don't buy this product if your tab is 12 inches or more and they don't have an option to return ... They have replace which doesnt serve any purposeThe holder becomes a dummy if the tab is more than 12 inches .. else great product ..I wish I could return this",
		"reviewStars": 3
	},
	{
		"reviewerName": "CloudTern Solutions",
		"reviewTitle": "Switching between devices works seamlessly",
		"reviewBody": "Switching between devices works seamlessly",
		"reviewStars": 5
	},
	{
		"reviewerName": "Arnab Dey Khan",
		"reviewTitle": "Groove not long enough for Samsung S7 FE (12.4 in display)",
		"reviewBody": "Adapted quite easily to the key set up, but groove can't accomodate landscaped S7 FE. Keys not as smooth as most desktop keyboard but okayish.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Jagadish",
		"reviewTitle": "Best productivity buy in recent times",
		"reviewBody": "Reviewing after one months of usage. Lot of care has gone into the product design from Logitech.1. I love typing with this keyboard much more than my PC and Mac keyboard. Feedback is unmissable. Though the keyboard is not for quiet environments..as the cluck noise is noticeable from distance.2. iPad and phone combo. - holder is very cool.  One can dock both comfortably.3. With this now I don't need a new laptop - iPad + keyboard is good enough.4. Great improvement in productivity combining the iPad pro's writing with pencil and type with keyboard all in one at much lesser cost than apple keyboard.5. Battery has not been replaced in this month. Sometimes i keep the switch on and looks like some kind of auto off also there. Else, it should have drained battery long time back.Overall, one of the most productive buys in recent times.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Vijayent",
		"reviewTitle": "Not ergonomic for MacBook Users",
		"reviewBody": "For macbook users, this keyboard will be a nothing but a disappointment.Cons- Keys get stuck at times, so its hard to maintain the continuity while working with this keyboard- Keys are at much higher height as compared to any existing macbook keyboard, so adjusting will take months.Pros- Good connectivity and battery life.- Small and compact.",
		"reviewStars": 3
	},
	{
		"reviewerName": "A",
		"reviewTitle": "Great Bluetooth Keyboard",
		"reviewBody": "I purchased the white coloured one. The keyboard pairs instantly with windows and Macbooks, I haven't yet tried pairing with Android tab yet. The Built is quite sturdy and the finish of the product is nice. As to the quality of keys, the slight concave depression in the keys help in typing and the keypad is well spaced out.Typing fast will take some getting used to but I am already able to type without looking at the keyboard. Very easy to connect and if you are looking for a multi devise keyboard for your workstation then this is the best. I paired this with a white logitech pebble series mouse and both work excellently in tandem. Would definitely recommend this. However note that this is not a portable keyboard and if you need something on the go you need to choose the other logitech model. The recess well built into the keyboard can easily support the one plue 7 pro and Samsung S6 Lite tab",
		"reviewStars": 5
	},
	{
		"reviewerName": "Oka Manisha",
		"reviewTitle": "Little bulky (height wise) and heavy too. But feels robust.",
		"reviewBody": "Had a Lenovo laptop, only 1 year old whose keyboard had problems. The local retrofit was costing 2800, so went in for this blue-tooth keyboard. The White color that I have bought looks sleek but the surface is glossy and needs to be taken care of. I feel this product should come with a protective cover since it's difficult to store this with the worry of its jutting out keys getting damaged and also needs protection from dust. Its dial that lets you choose and connect with three devices is absolutely a boon. My overall experience with Logitech has been really good, so far that is.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "Useful",
		"reviewBody": "Very useful .If would have been better if weight was lighter",
		"reviewStars": 4
	},
	{
		"reviewerName": "safwan",
		"reviewTitle": "Super product,",
		"reviewBody": "very happy that I ordered this. Had read reviews a lot.  if you need this where you have set up at home with screens and stuff, this should work very good.I have been using it now for 6 months and the battery has not drained.the connection is super smooth with no issues every time I open my laptop,The keys are noisy a little while typing but I like that sound.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Rajesh",
		"reviewTitle": "Work OK so far for last few months.",
		"reviewBody": "But I notice an issue that the keyboard gets disconnected by itself while working. Has anyone faced this issue? anyways to fix this?",
		"reviewStars": 3
	},
	{
		"reviewerName": "Nithin Ben",
		"reviewTitle": "Good portable keyboard",
		"reviewBody": "Pros:1) Portable , a bit heavy but that is used to keep the it from toppling when a mobile or tab is hoisted on it2) Sturdy stand for portable devices on the keyboard, very useful while working3) Can type on three devices, this is pretty handy4) Nice color (chose the green one)5)Well spaced keys, feels good to typeCons1) No back light, cannot work in the dark2) Noisy keys (but ok, can manage)3) No home and end key, have to use function keys for thatOverall I am finding this keyboard quite useful in doing my daily work. I am a coder and am quite cotnent and happy to own this keyboard.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Sunil Kandi",
		"reviewTitle": "Good product to buy. Few monior things for consideration",
		"reviewBody": "Keyboard is very useful. What i like about this product is 1) Connecting to 3 devices 2) holder for keeping the tablet and phone is really nice. 3) compact and easy to carry 4) my kids love this keyboard.What i dont like about is1) you cant work in the night or in the darkness as there is no inbuit keyboard light2) caplock key light is not rovided. So, you cant identify whether caps lock is on/off without typing the key3) typing sound. People can hear typing noise.These are not major drawbacks though.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Kinnari Shroff",
		"reviewTitle": "Most Compatible Keyboard for all devices ;-)",
		"reviewBody": "I aint too tech savvy in terms of using multiple keyboards over the years but i am so glad i bought this one! The keyboard of my Microsoft Surface Pro 3 was damaged and using the virtual one was difficult bcz i work on ppt's and excel. Was on the lookout for a decent smaller than usual bluetooth keyboard and Logitech K480 is the Perfect one! Love the multiple device usage where i can type with 1 keyboard for 3 devices. Although it doesnt fit the Surface Pro i have but i am not complaining as it has an inbuilt stand so i can use the keyboard dock to put my phone inn. Bluetooth compatibilty is excellent and it easily fits in my laptop sleeve bag along with my MS Pro 3.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "Best Wireless Keyboard option I've found",
		"reviewBody": "It's been 2 years since I bought this product. Have found no glitches so far. Perfect usage. Almost daily I spend 5-6 hours using this keyboard and not a scratch. There is almost no lag for bluetooth connection with my macbook. I can hit upto 100 keywords per minute on this keyboard. If you want more speed, you could try a wired keyboard. The multiple options setting is great but I rarely use it. The ridge on the top of the keyboard is great if you're travelling with a tablet or something. I use it to hold my phone sometimes. Could be amazing to use it with a tablet or a touch screen laptop. Satisfied with my purchase. Recommend it.",
		"reviewStars": 5
	},
	{
		"reviewerName": "MT Inc.",
		"reviewTitle": "Functional, But Not Portable",
		"reviewBody": "I bought this keyboard after using my wife's K380 for a while. While this keyboard is more functional than the K380, it is definitely not as portable. It's twice as heavy and a lot longer too.Since I won't be traveling with this keyboard, its portability doesn't affect my usage as much. It's a great keyboard otherwise - the keys are perfectly sturdy, well spaced and suited to long hours of typing.If you're looking for a travel keyboard, wait till the K380 is in stock. If you plan to use a keyboard at home only, the K480 is perfectly fine.",
		"reviewStars": 5
	},
	{
		"reviewerName": "SKP",
		"reviewTitle": "Very good keyboard that can be used with three devices",
		"reviewBody": "Chicklet key board, appears small, but no difference you will notice after using it. Right size. It is chicklet and throw is a bit old school.The knob on the top left allows you to select between three devices.Turn it to one position and connect it with dedicated button in the right, once connected to device (all major OS are supported)It takes about 2-3 seconds to connect when changing devices. No battery replacement issues like chinese stuff/consumption seems to be very well optimized. It will last for over six months or as advertised if used daily.  I use it daily, no issues so far.Has good weight (you will be surprised) to ensure the device doesn't move around when you type. It is good to see Logi has taken so much care to design it well. Weight can be an issue if you want to carry it along.Good buy if you are looking for a keyboard to use across devices.  No complaints,  works good.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Sourav Patil",
		"reviewTitle": "Best for multi device users!!!",
		"reviewBody": "I like this product because it's so easy to switch to any device I want and it made my work lot easier, I'm developer and I was looking for product like this.Pros :1.Good connectivity2.Large keys3.Supports Android, Windows, iOS4.Great keystroke sound(if you are fan of it)5.Switching to other devices is also fast.6.Good battery lifeCons:1. On/Off button is on bottom, so it's get difficult to turn on/off often.2. If you are not fan of keystroke sound then it might get disturbing for you sometimes( In that case go with Logitech K380).3. Doesn't has Caps On light.",
		"reviewStars": 5
	},
	{
		"reviewerName": "What's in a name?",
		"reviewTitle": "Good, heavy but not for ipad pro 12.9",
		"reviewBody": "Its heavy, and if you use phones with rugged,bulky, protective. covers they wont tilt in the cradle.keys will be good if you are used to mechanical keyboards but really hard if you are used to soft keys.portability is an issue too because it weight just 200 grams shy of a kilo.😬so go for it if you know your usecase properly",
		"reviewStars": 5
	},
	{
		"reviewerName": "Viswaroopam",
		"reviewTitle": "Very poor battery life. Battery gets drained in 2 weeks. Stuck with the product! :-(",
		"reviewBody": "After using for a month.I never imagined that this costly keyboard will fail for such a basic reason.In 4 weeks, I had to change the battery 3 times (alkaline battery) till now! This is against their 2 years battery life claim.Utterly disappointed. At this rate, I will need to spend atleast Rs.1200 on battery every year.6th week update: Submitted the keyboard at service center for replacement.7th week update: Got the keyboard replaced. The previous keyboard was not getting switched off by the switch near the battery. The replacement appears to be working fine.8th week update: The replaced keyboard appears to be working fine.",
		"reviewStars": 1
	},
	{
		"reviewerName": "Jyotirmoy Das",
		"reviewTitle": "Plug, Play & Away",
		"reviewBody": "I needed a portable keyboard which worked with both my Macbook & Windows laptop without requiring me to fiddle around with bluetooth settings everytime I switch.This fit the bill perfectly. Twist the knob & bam! Device connected & works with the concerned laptop effortlessly. Easy to type, connect & carry. No further issues. Would have loved the indicator to display whether it was connected to the windows laptop or macbook.This is not a full fledged keyboard so anyone looking to type long documents or do coding, steer away.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Karan Gupta",
		"reviewTitle": "Near-perfect",
		"reviewBody": "It's incredibly easy to setup and I went from unpacking the keyboard to typing on my phone in about 3 minutes. Some reviewers complained about the keyboard being noisy but I personally like the tactile and sound feedback while typing so it's something that I see as more of a feature than a bug. The keyboard is 95% the size of the keyboard on my laptop so it doesn't feel cramped while typing at all. The dents on the 'F' and 'J' keys aid touch typists as well. The built-in stand fits my phone snugly, securely, at a decent viewing angle.Keyboard shortcuts work as well and it's possible to navigate android (Android 8.1 on my Moto G4 Plus) almost entirely with the keyboard and not having to touch the phone - although more modern navigation features on android aren't fully supported as this is an older keyboard. Kinda why I knocked off that one star and am giving this four stars.Build quality is decent as well considering the price-point. Obviously it would be silly to expect stellar design and craftsmanship at ₹2000.But hey, if all you have to do is typing on the go, this is perfect.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Ramanan",
		"reviewTitle": "Portable and powerful",
		"reviewBody": "This is small but heavy compared to other full size keyboards. But it's pretty comfortable to carry. It funny have caps lock indicator light built-in but there a application which can display caps lock status when active. So far so good. Hope this one last for another coupled of years without any faults.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Ayush Singh",
		"reviewTitle": "Great design but see if it does what you need",
		"reviewBody": "READ CAREFULLYIt's an aesthetically beautiful design. I've been using this keyboard for over a few months now. Connectivity is superb, with all the 3 pairing modes and regardless of Android/Mac systems.Here's the catch, for Mac users, it doesn't have a brightness control option on the keyboard. You could possibly program it using the Logitech App. The arrow keys may be a little inconvenient because they're small.Perfect for iPad mini, air & pro. But not ideal for iPad pro 13 inch. A 13-inch would fit in the keyboard slot only vertically but it's too big to hold the weight.",
		"reviewStars": 5
	},
	{
		"reviewerName": "arif",
		"reviewTitle": "Good design",
		"reviewBody": "Design goodTyping is quite tough and iPad response is quite slower while using keyboardWeight is more than expected",
		"reviewStars": 3
	},
	{
		"reviewerName": "Samdarshi Paul",
		"reviewTitle": "Heafty",
		"reviewBody": "Quality is great. You will get to know just when you hold  it in your hands. But it's quite heavy, heavier than my iPad.So it's not at all good for travel. I never expected a keyboard to be this heavy.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Alisha",
		"reviewTitle": "Heavy, but good!",
		"reviewBody": "Awesome, comfy keyboard. A little heavy so it's not super portable, but definitely can be if you need to carry it in a laptop bag or backpack, for example.I love the slot, it holds my ipad as well as phone really well. Super good if I'm typing on devices that are not my laptop (or even as an alternative to my laptop). The keys are not quite but I love the tactile nature of that. So if you're after something quiet, this may not be it.The toggle function is great, really useful. Overall really happy with this!",
		"reviewStars": 5
	},
	{
		"reviewerName": "Savan",
		"reviewTitle": "Best Multidevice keyboard at this price range.",
		"reviewBody": "Pros:Can use multiple devices and easy to toggle between them.Portability: There is no need to carry a stand or usb dongle.Smooth typing experience with proper tactile feedbackKeys are well placed; Great Flow for fingers.Bluetooth connectivity is fast and Reliant.Battery stays significantly longer as advertisedCons:Weigh is as much as a tab or Ultrabook;Sound can be a little bit over the expectation; Not very quiet.Overall one of the best available bluetooth keyboard at this price range.",
		"reviewStars": 4
	},
	{
		"reviewerName": "pixelman",
		"reviewTitle": "Bad quality keyboard",
		"reviewBody": "When it comes to keyboards, I know what I am talking about. Over the past 30 years, I have used various keyboards, such the early model TVSE cherry key mechanical keyboards to the latest Apple magic keyboards. I also have been a frequent Logitech buyer; having purchased various mice, regular keyboards and for a while I was using the K800.By far, the K480 is one of the worst keyboards that I have used. This is as bad as the cheap Chinese brand keyboards that can be bought for a couple of hundred Rupees.Why are some of the reviews so great?(1) Most of them seem to be initial reviews of first time buyers - who are buying their first Bluetooth keyboards, so they have nothing to compare against.(2) There might be a difference in the build quality of various batches. Maybe I got a unit from a bad batch.(3) They are zapped by the good design and the fancy looks and forgot about the main function; i.e. how well it types.With online schooling becoming the norm, I decided to order this K480 for my daughter, to use with her laptop. Within a couple of hours of trying it, I have requested for a return.Why am I returning it?(1) Some of the keys are not working! The left arrow key refuses to work unless pressed really hard. The 'f' key gets missed out frequently. The Back button sticks if you strike it at the edges and not exactly in the middle.(2) Overall, the keys tend to be a little sticky unless you press them exactly in the middle.(2) The keyboard is not ergonomic. i.e. it is absolutely flat on the table. Which means that you have to lift your wrists off the table again and again to type. (The addition of small adjustable legs could have sorted it out.)(3) Keyboard is quite noisy! It is as noisy as a big old membrane keyboard.Why is this one of the best selling keyboards?Low Price Point. This is one of the cheapest multi device keyboards from a well known brand. So, people are buying it.Whatever may be the the other issues, I am disappointed by the fact that the keys of a new keyboard are not working. Bay build quality / quality control by Logitech.",
		"reviewStars": 1
	},
	{
		"reviewerName": "Divye Ruhela",
		"reviewTitle": "Works with the PS4!",
		"reviewBody": "There are a lot of conflicting statements on the internet about whether this product works with the PS4 or not. I bought it to use as a wireless & dongle-less keyboard for my Base PS4 and it worked! All you have to do is press and hold the windows/ android connectivity button on the keyboard, go into the PS4 bluetooth devices settings, type the number/ key when prompted, and press Enter (you will not see the key being typed on the screen as there is no window to type it in. Just type it correctly and press Enter). And you're done! If it doesn't work for some reason, turn the dial on the keyboard to device 2 and try again. For anyone looking to use it for console gaming, the device works great. The lag is unnoticeable. I only use it for in-game chats though.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Sandeep Pillay",
		"reviewTitle": "Durable keyboard, good enough for kids",
		"reviewBody": "The best feature is the keyboard's robust build quality. Even my 10 year old appreciates it, so i have given it to him for exclusive use.The keys have a firm typing feel, yet key travel is less than a traditional keyboard. The base is thick, and doesn't bounce around on the typing surface.I appreciate the packaging, the features and also the unique tablet slot.What i miss is an option for a USB connection when Bluetooth is not available.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Kapil",
		"reviewTitle": "Good build and multi device utility",
		"reviewBody": "I have been using this product for a month now, primarily for the sake of typing on my laptop as I set up a more ergonomic workstation.Pros:1) Good multi device connectivity with additional function keys for my Mac, Windows and Android devices2) Fast single key presses after connecting3) Battery life is low with device going into stand by mode smoothly4) Good build quality and compact sizeCons:1) When using Shift+key press or Ctrl+key press, the key board occasionally doesn't register the input.2) The key board of broad in width, which means your workstation needs to have additional space to support your wrists.3) They keys are slightly small which may make it a bit challenging for people not familiar with typing. Personally, I love this keyboard and it is one of the best options available in market.",
		"reviewStars": 5
	},
	{
		"reviewerName": "GB",
		"reviewTitle": "Does not connect to Raspberry pi",
		"reviewBody": "My main purpose to buy this was to switch between raspberry Pi and laptop. Since pi is neither windows nor iOS, Bluetooth connectivity does not work.",
		"reviewStars": 3
	},
	{
		"reviewerName": "MOUSUMI DUTTA",
		"reviewTitle": "The greatest keyboard ever made for an iPad",
		"reviewBody": "It's a versatile keyboard. Its multi-platform supported and typing experience the best.Well, let me break it down into pros and cons.Pro's:• The key press is just awesome• Multi-device connectivity works just fine• The device stand is very useful• Its size and feel is quite premiumCon's:• It's a bit on the heavier side• Keys make a little noiseFinal Verdict:This thing surely is not made for gamers. If you are somebody who writes e-mails, articles and other stuffs on multiple devices, well then you have found your match.It is the ideal replacement for the apple keyboard which can turn your iPad into a mobile workstation at a much lower price tag.It becomes a great companion for a tablet, especially iPad.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Apurva",
		"reviewTitle": "Does it's job well.",
		"reviewBody": "I have a Samsung tab whose external keyboard stopped working and I got this keyboard for a much lower price. It does the job so I'm happy. Just that it's slightly heavy to be carried around with a tablet and typing on it is noisy. Nothing to complaint about for this price and I'm still glad it exists.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Varun",
		"reviewTitle": "It's very helpful to type on your tablet on your phone..",
		"reviewBody": "Recommended!",
		"reviewStars": 5
	},
	{
		"reviewerName": "Muhammad Adnan",
		"reviewTitle": "Worth buying for",
		"reviewBody": "I really like the clutching sound feel and it's really comfy while trying, plus the stand dock is really useful and seriously I bought the keyboard just because of its dock as it stands different from other keyboards with the feature. I would say it is a bit bulky however worth buying for.",
		"reviewStars": 4
	},
	{
		"reviewerName": "vimal rawat",
		"reviewTitle": "Poor keyboard for typing purpose",
		"reviewBody": "For fast typing purpose, key are stucking when you press the keys. Overall connectivity is good, keys size are shrink.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Amit Pandey",
		"reviewTitle": "Superb keyboard for travellers",
		"reviewBody": "Most useful tool for every pc & multi device user. It's easy to carry and Bluetooth connectivity is superb. It takes less battery , in past 2 months I haven't changed battery and it's working superbly.Only cons is not having mouse, we should have mouse or something along with this. If you are using this mobile or tab, mouse isn't there. Rest is good",
		"reviewStars": 3
	},
	{
		"reviewerName": "Andagi Irshad Ahmed",
		"reviewTitle": "Did not excpect this 5 ++",
		"reviewBody": "First of all i would like to say that this keyboard is heavy, Which is actually an advantage as far as useability is concerned. If your dont like such weight go for other option from logitech. Because of its weight it could hold a tablet comfortabaly without turning/flipping itself though could not adjust the angle like you do freely in laptops. Also because of its weight it could be used on your lap as laptop do with some medium difficulties. Key travel is good and connetivity is also of no issue till now. I am writing this review with the help of this keyboard on my galaxy S6 lite tablet. There are keys which would help while using the tablet like home button. I had searched for other keyboards but could not find any that provides quality & brand name at affordable price. So go for it you wont be disappointed .",
		"reviewStars": 5
	},
	{
		"reviewerName": "Turwash",
		"reviewTitle": "WORTH BUYING",
		"reviewBody": "I'll not suggest for gaming, but its too smooth for typing purpose and even codingBut why not given capslock on signal??? I really get confused when my capslock is on and when is off.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Ravi",
		"reviewTitle": "Good and economic keyboard",
		"reviewBody": "Good keyboard",
		"reviewStars": 5
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "Clunky and heavy - Not recommended",
		"reviewBody": "Surprisingly heavy - probably so that it forms a strong base for keeping a tablet in the notch. However, my Lenovo Chromebook Duet slips off from the vibrations in either mode so its not very practical. I haven't tried that on a table though - maybe that will work better.Keys are clunky, clackety and require a pretty deep press to register. They feel strangely squishy like some toy keyboard especially since I am replacing a Logitech Ultrathin KB cover.Some of the keys like the left Ctrl, Alt, etc don't register until they are pressed pretty hard right in the center making them very painful to use.I would also have preferred having a function disable so I can use the function keys without having to press the Fn key. I have not found that option. This is a minor complaint.Plastic quality is decent but it is plastic. Keyboard has no flex and seems solidly made (and did I mention heavy?).Haven't had it long enough to comment on battery life. Batteries were included. Thank you.Bluetooth connection was very easy and signal is stable and response is quick.I did manage 75 words per minute with very fairly high accuracy in a typing test. Although I suspect I might get used to it over time, I personally do not enjoy using this keyboard. I find the  squishiness very annoying, the need to force press Ctrl, Alt keys painful.I would not recommend this keyboard.",
		"reviewStars": 2
	},
	{
		"reviewerName": "Aman Jain",
		"reviewTitle": "Perfect for multi device use..",
		"reviewBody": "All over pretty good keyboard.. switch device is seamless, I use it with windows laptop, mac as well as ipad and it switches between the devices perfectly.. I just takes few seconds to connect to mac but I thing that's issue with mac connecting with non apple device.. I even use it to play cs on my Mac and irlt works perfectly whereas sometime wireless mouse lag but not this keyboard.. I just gave it four rating because 2-3 keys are a little less resposive than others.. f and alt key takes a little extra pressure to press.. otherwise amazing keyboard..",
		"reviewStars": 4
	},
	{
		"reviewerName": "Mr A",
		"reviewTitle": "Solid 4 stars",
		"reviewBody": "All my logitech peripherals have proven their worth over time and this I assume will be no different.  Logitech has excellent quality control over their products. This keyboard is very good overall. I only wish it was a bit lighter and that the keys were a bit more firmly placed. The typing experience is not the best  but for occasional use with a smart TV, tablet etc its fine.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Haroon khan",
		"reviewTitle": "Keyboard ki awaaz jyada hai.",
		"reviewBody": "Is keyboard ke button  complete flat nahi button sides upar ko uthi hui  hain jiski vajah se button dabane me kaafi der tak ungli dukh jati hain.Baki iska performance bahut acha hai typing speed bilkul accurate hai.screen par button dabate hi print ho jata hai without any delay.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Avinash",
		"reviewTitle": "Bulky",
		"reviewBody": "Too much heavy and bulky. Not at all portable and easy to carry stuff.",
		"reviewStars": 2
	},
	{
		"reviewerName": "sangram barge",
		"reviewTitle": "Good",
		"reviewBody": "Looks good bit lag but I don't know how common is that in Bluetooth keyboards as using this for first time. Bit sound but I like it gives u feel of typing on mechanical keyboard. One drawback is that it doesn't support usb cable I wish that option was possible in this only Bluetooth connectivity is possible",
		"reviewStars": 4
	},
	{
		"reviewerName": "Amazonlov",
		"reviewTitle": "Best ergonomic and thoughful keyboard",
		"reviewBody": "very good product.. the keys might be bit loosly jumpy when compared to your smooth laptop keys of a Lenovo L14 or my recent wide keypad of Dell inspiron, but howser given he seamless bluetooth connection you might not notice the keys...But while raching the backspace and restricting your fingers the the A's might take a few days of practice.. It definitely gives your the feeling to wirte more if you are a writing freak..the phone and tablet holder will just make life easier ergonomically and saves so much space when you have a clutter of books and the laptop hovering over the table, Best buys for a typical sit down laptop table",
		"reviewStars": 5
	},
	{
		"reviewerName": "Dibya",
		"reviewTitle": "Backspace button not working properly",
		"reviewBody": "Backspace is not working properly",
		"reviewStars": 1
	},
	{
		"reviewerName": "AARSHDEEP",
		"reviewTitle": "It's bulky. You cannot use any cover case with ipad while using the keyboard.",
		"reviewBody": "The compartment provided to hold the ipad is very small. One has to remove case/ cover of ipad to use it. It must have been wide enough.",
		"reviewStars": 2
	},
	{
		"reviewerName": "Batlanki Akshay Niranjan",
		"reviewTitle": "An excellent product!!!",
		"reviewBody": "Its seriously so good...its completely worth the money...and the stand for the tab or phone can be used for your online classes too...and you can easily switch between devices ...the only faults I found are 1)the power button is on the back....so you need to lift a bit to on or off and 2)this actually works on  batteries and it would be great i there could be a wire...no issues with that actually....thought it would be good if there would be a cable.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Sagar Bhalerao",
		"reviewTitle": "Connectivity is good, no lag, can't type with full speed",
		"reviewBody": "Look - perfectConnectivity - no issuesSpeed - can't type with full speed.No any lag",
		"reviewStars": 4
	},
	{
		"reviewerName": "Desi",
		"reviewTitle": "Budget bluetooth keyboard.",
		"reviewBody": "Wanted a tablet specific bluetooth keyboard. K480  came with a groove and does the job well.The product is nothing too fancy, not smooth perhaps. But it does the job in budget,  despite typing lags. Takes a while to adjust to the keys. Keys feel mechanical and not effortless. Typing for long is full of hassles but i would say its just a matter of time before one adjusts to it. Logitech has built better devices at these prices, and can definitely improve.Recommended as a bluetooth keyboard on a tight budget.",
		"reviewStars": 4
	},
	{
		"reviewerName": "ఏమి?",
		"reviewTitle": "A device that deserves to be in everyone's mobile arsenal.",
		"reviewBody": "I did not want to post a review till I got some good use in. And after typing close to twenty pages on an Android tablet using this baby (not to mention the other typing I go in with it on the PC and on the phone), I can unreservedly recommend this product!While the selection knob is easily its best feature, there are others that prove equally worthwhile.1. The groove that is provided to rest your devices in is padded and it can easily seat a 10inch tablet with its cover on. I use it with a Galaxy Note 10.1 with the folio case on, and no sweat!2. The keyboard is full sized (barring the direction keys) and it is incredibly comfortable to type on, and the tactile feel on the keys is just perfect for me. ( I like them clicky)3. The build quality is solid (some might find it heavy)4. The base has some really nice rubber paws that really grip smooth surfaces, so dislodging the keyboard accidentally becomes less of a possibility than ever.5. Dedicated screenshot key! My phone and a tablet are both Note # devices, and I still feel that a screenshot key is a fantastic addition.The only problems I have had is that the screen lock shortcut does not work with my note devices but seems to work with OnePlus One, and Nexus devices just fine. I am guessing it might be a Samsung issue than the device issue.And a slightly more serious issue is the lack of a shortcut or preferably a dedicated key to expand the notifications. That would have made it is perfect 6 star keyboard.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Karthic S",
		"reviewTitle": "Nice product! Best wireless Keyboard.",
		"reviewBody": "I am using the keyboard for more than 15 days. Only negative is screenshot button present under function alternate key, then home and end button not available. Other than that all features are good value for money. Go for it if you need a wireless keyboard.",
		"reviewStars": 4
	},
	{
		"reviewerName": "GK",
		"reviewTitle": "Value for Money. Won't regret buying it.",
		"reviewBody": "Very nice product for the Price, works with all devices android phones, iPhone, IPad and also our Smart Tv. It is heavy for a reason, so that devices such as iPad do not fall off. If the usage is at home or any one place it is good, may be not very portable friendly. Also a few technical issues such as it suddenly starts typing in Hindi, and some sticky key symbol comes up on apple devices, but there are minor and resolvable issues. I had bought this since the magic keyboard was not available online, but now I feel I wont need it. I am more than happy with this Keyboard, which can be paired with multiple devices and the typing experience, the quality and efficiency is also very nice. It does not need charging which is also good in a way.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Shrinath Yelthimar",
		"reviewTitle": "Value for money",
		"reviewBody": "Received it yesterday. working as expected. i can change the device just turning one knob. currently using ot for tab laptop and phone. working perfectly fine.if you are looking for a key board to multi task in multiple devices then you should go for this one.",
		"reviewStars": 5
	},
	{
		"reviewerName": "vivek",
		"reviewTitle": "Waste product while connecting on both phone and laptop it's connecting on only one",
		"reviewBody": "Waste product while connecting on both phone and laptop it's connecting on only one….",
		"reviewStars": 1
	},
	{
		"reviewerName": "Bablu Sah",
		"reviewTitle": "Complete functional product.",
		"reviewBody": "The 3 modes switchable button, reasonable cost, using since 1.5 years so durability, using it for note-making every single day and hitherto battery did not show any sign of degradation, everything in this product fulfils the utilitarian characteristic. Logitech always booms.",
		"reviewStars": 5
	},
	{
		"reviewerName": "BR",
		"reviewTitle": "Amazing product",
		"reviewBody": "Very easy to connect with devices. Works like a breeze and switching between devices is easy. A bit heavy and bulky to carry. But overall a good product.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Cookie's Mom",
		"reviewTitle": "A bulky AF keyboard!",
		"reviewBody": "First off, it's a heavy Bluetooth wireless keyboard so can't carry it around. Quite noisy when you type. In terms of pairing, ease of access and number of devices you can connect - efficient. You can connect upto 3 devices on it at the same time and switch modes to make them work. Same as a regular qwerty keyboard if you're wondering about placement of keys. It can hold your large ipad (upto 10.2 inches)/phones and tabs comfortably in the slot provided.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Sivarama K.",
		"reviewTitle": "Do not buy",
		"reviewBody": "Heavy weight unable to portNot comfortable at all with heavy keys and its thickness hurt your wristsOnly pro is it works with multiple devicesTotal waste of money",
		"reviewStars": 2
	},
	{
		"reviewerName": "Mayank Kumar",
		"reviewTitle": "Nice",
		"reviewBody": "Really like the productivity and portability this brings. Good quality overall.",
		"reviewStars": 4
	},
	{
		"reviewerName": "neil koshy",
		"reviewTitle": "A Capable multi-tasker",
		"reviewBody": "I have been using the K480 Bluetooth keyboard for the past one week  with my monitor (connected to my macbook air) and must say am quite satisfied.It is compact in dimension and looks quite attractive.Though many have complained about the weight i have no issues with the same as i don't intent to carry it around.Connection with my mac was quite easy and hassle free.Claimed battery life of close to 2 years is a bonus.Though most of my thoughts about the keyboard are positive,coming from a macbook air,I found the keys of the K480 to be a bit clunky and noisy.But given the price point(Got it during a lightning deal) i would recommend the same,though my first choice was a magic keyboard.But the 4 times cost of the same tilted the scales in favor of the K480.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "Good value for the price",
		"reviewBody": "Easy to connect to multiple devices.It is working smoothly.It is a little bit noisy while typing.",
		"reviewStars": 4
	},
	{
		"reviewerName": "@b#!",
		"reviewTitle": "Excellent product",
		"reviewBody": "Premium product a bit heavy But its durable and value for money",
		"reviewStars": 5
	},
	{
		"reviewerName": "Bhaskar Sengupta",
		"reviewTitle": "Bluetooth keyboard with smartphone/ipad holder",
		"reviewBody": "The Good:Bluetooth switching (as it is a multi device keyboard) via the dial is effortless, once paired. The holder for smartphone/ Ipad is sturdy and, as the keyboard is heavy, doesn't tip over at all.I tested with IpadOs, Android 9.0 , windows 10, mac os mojave. Shortcut and media keys work fine.The price is okay considering it's made by logitech.The Bad:The keys are a bit noisy. Typing experience and key feedback feel like any membrane keyboard.If you need quality fast typing or gaming experience look elsewhere. Though this one might last you a long time so think before buying.I'm keeping it for the convenience and price paid.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Praveen",
		"reviewTitle": "Amazing product !!",
		"reviewBody": "Just woowwww! Got this product on  time and has been using since 3 months . I am doing wfh and sitting near the system was  to hectic , using this I can maintain the distance .Connection is super instant and there is no delay . I am using my mobile , tablet and laptop at the same time and the experience is super. Just go for it .Cons - making too much sound and a little heavy . But still ok as this serve my purpose .",
		"reviewStars": 5
	},
	{
		"reviewerName": "Kush Mishra",
		"reviewTitle": "Stable Sturdy And Convenient",
		"reviewBody": "Just Brilliant ! Really loved the feedback on keys and its heavy yes! But it's so rightfully as it has to hold on to iPad Pro Mate !",
		"reviewStars": 5
	},
	{
		"reviewerName": "Colin Varghese",
		"reviewTitle": "Ok sort, does the work",
		"reviewBody": "Sometimes the keys lag but mostly it works. it is okay to use if you have multiple devise and need to keep switching between them and the devices are placed near by",
		"reviewStars": 4
	},
	{
		"reviewerName": "Anoop Jha",
		"reviewTitle": "Great Companion for my IPAD",
		"reviewBody": "Update:- it weigh too much, I understand it is done to balance the device while holding but still its too heavy (850g). Was looking to return but unfortunately that is not available for this product. Reducing my review by 2 stars :(Was looking for a keyboard for my IPAD since long, my wish is to get something which i can carry while travelling and hence looking for ones coming as case but because of higer price point, i ended my search on K480.Great delivery experience by Amazon agent, booked yesterday night and got delivery today at 03:00 pm.Wrinting this review with the key board which explain easy to connect and use, within 1-2 minutes of opening the packet, i am ready to type.Looks is also strong so i think it will last longer.Will comeback later with detailed review however at the moment i can say at this price point this device will complete your requirement of not using laptop :)",
		"reviewStars": 3
	},
	{
		"reviewerName": "Syam",
		"reviewTitle": "Good for Ipad8 3rd generation",
		"reviewBody": "Item received in good condition and working fine with IPad 8 3rd  generation..Browser missing with this package. But you will get easily in YouTube..",
		"reviewStars": 4
	},
	{
		"reviewerName": "Dr K.",
		"reviewTitle": "Convenient and Compact.",
		"reviewBody": "it is better than what I expected. i'm usint it right now to write this review and its wonderful. I bought it for my 10.1 inch Huawei tab, and it fits perfectly. the triple connection feature is just a delight. I could be using my tab one second and instantly switch to my PC which is connected to my tv and then switch back to my tab effortlessly. The only thing I find a bit inconvenient is that the keys on the keyboard are a bit too raised and it takes a little more pressure than the usual keyboards to press down but I think, with a little more use i'll get used to it. I would also like to mention that the plastic is not of very good quality and the base and cover seems to be seperating on its own and needs to be snapped back together (poor transportation I guess, damn you Amazon delivery ! lol) and for that reason i'm giving it a 4 star rating. Overall, I love it and I would recommend it to anyone who studies from E-books, likes to take notes in class, does work that requires a lot of transcribing or email writing, or any other thing that requires a keyboard. Cheers !",
		"reviewStars": 4
	},
	{
		"reviewerName": "Rajesh pabari",
		"reviewTitle": "Too Heavy (800 gms! Seriously?) Overall sturdy, but too heavy.",
		"reviewBody": "Good product, good responsive to switching devices takes around 2-3 seconds when switched device.overall good, except that it's tooooo heavy.. Battery died in 5 months as compared to claimed 1 year. New duracell costs 160 for 2 pairs. Not a big issue given the utility. Switching between devices connected is smooth and faster than i expected it to be.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Zen",
		"reviewTitle": "Best bluetooth keyboard with cradle",
		"reviewBody": "Packaging : Not good . Considering price, it came without Amazon box which is not good.I purchased it for ipad because I need this to work like mini laptop. Initially i was reluctant to buy in place of Bluetooth mouse. But hold on for a second, you must buy this instead of mouse for ipad.It works like charm though buttons are not smooth but the functions it have are amazing like search , screenshot etc .Many people are saying that it is heavy due to cradle.I thought maybe it has the weight of brick but trust me it is worth to hold devices like mobile ,kindle.Happy to use it like windows laptop.",
		"reviewStars": 5
	},
	{
		"reviewerName": "A",
		"reviewTitle": "For work but not really for gaming.",
		"reviewBody": "Bought it over a year ago but actually used it during the lockdown for gaming and work.Great for work. Only suggestion I have is that it should've had the sleep/power on&off button with which one can remotely perform the functions without opening the lid of the laptop or manually pressing the power button on the PC.For gaming it's above average. I play a lot of CS GO and I didn't really face any lags as such. The responsiveness was very quick and I still use it to game when I get some free time it between work. :PRecommended but I believe the pricing should be reduced by a few hundred bucks.Also very good in terms of portability.Bought it for ₹2,332 in May, 2019.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Vaibhav",
		"reviewTitle": "Good keyboard with few kinks",
		"reviewBody": "Have been using this keyboard for about 2 weeks. Overall I am quite happy with the purchase with some minor issues:Pros:* Solid build with almost mechanical feel to the keys.* The rotary dial to switch between the device is clever engineering.* The holder provided to place your phone or tablet is really convenient.* Rubberized back grips any surface with ease and provides solid foundation to the keyboard.* Round keys are comfortable to type on compared to traditional square keys.Cons:* Bit on a heavier side to carry around.* Phone/Tablet holder is bit thin. So if you have a case for your phone/tablet then you will have hard time placing them at a comfortable angle.* Switching devices is not lightning fast. Expect a delay of about 2/4 seconds before keyboard connects.* No page-up/down or end/home keys. You need to press a weird combination to emulate those keys. If you use these keys a lot then think harder before purchasing.* Logitech Preference Manager software not available for Linux. So I am kinda stuck using the an un-ergonomic way to simulate them i.e. Fn-Key + Function-key. Though there are workaround available on the internet but they most of them dont for most recent h/w revision.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Shashikant",
		"reviewTitle": "Simple and brilliant keyboard",
		"reviewBody": "This is a must have keyboard for profesional typing requirement. Once you get hands in perfect position on the keyboard, you will glide through writting every word.Kudos to the team for making this masterpiece.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Anshuman Parashar",
		"reviewTitle": "HOME + END buttons missing 😭",
		"reviewBody": "Overall it's a nice product. Connectivity is great. Not too heavy, not too light as well. Two things I am missing the most while working on this is HOME & END buttons aren't there + screen brightness control isn't there. If Logitech can add these things to the future versions. It would be just awesome product.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Prajwal Jha",
		"reviewTitle": "Small and simple",
		"reviewBody": "Good for occasional use. It is portable in size but it is heavy for potability or to carry. Since it can only be connected by Bluetooth from iPad or other devices,2pencil batteries are required to run the keypad.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "Transition is effortless, but too loud",
		"reviewBody": "Using mac spoils you and you end up having too high expectations from all products. Since magic keyboard wasn't available I opted for this. I use two Macs and an ipad for online teaching and this is THE ONLY option that so effortlessly allows me to shift from one device to the other. The only glitch is the sound and heavy keys - I am so used to the soft touch of mac that it feels like hammering on a stone. Especially when I am teaching and recording, the click sound is too irritating.Would still give a 4.5/5 for it delivers what it promises.Worth buying for general purpose. Teaching or online webinars - use a Mike instead to conquer the \"noise\"???",
		"reviewStars": 5
	},
	{
		"reviewerName": "Zubair Mohammed",
		"reviewTitle": "for the price it offers amazing features for Mac",
		"reviewBody": "it offers great quality, the keyboard is sturdy and gets most of the work done in a mac fashion.I work with a Mac and its easy to get used to the keyboard. What it lacks is the tactile feel, i feel like its typing on a hard keyboard. not the best typing experience but am sure its something that you need to get used to .",
		"reviewStars": 4
	},
	{
		"reviewerName": "NAWANG GAILAK",
		"reviewTitle": "Good",
		"reviewBody": "Till now no issue",
		"reviewStars": 4
	},
	{
		"reviewerName": "Mahitha M.",
		"reviewTitle": "Nice keyboard but a bit heavy",
		"reviewBody": "It's a good keyboard overall.It's heavy, but on the flip side weight ensures to hold your ipad in place, so your ipad actually feels like a small laptop which is quite nice.The keys feel plastic-ky, not expecting this for 2600 bucks.Ergonomics is awesome, you don't have to worry about carpal tunnel.It's an awesome keyboard if you're not worried about how the typing sounds like and if you don't mind having a heavy keyboard.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Ashish Agarwal",
		"reviewTitle": "A Good Design Lacking Expected Logitech R & D!",
		"reviewBody": "Pros1. Nicely thought of socket for tablets of all types, serving as a stand, providing a good viewing angle.2. Connectivity options for three gadgets.3.  Rich looks and sturdy built.4.  Layout, size and shape of keys is user friendly (except for extra pressure required to operate keys which is not a major constraint).5.  Low power consumption hence long battery life.Cons1.  No charging facility for batteries.2.  Very heavy.3.  Despite its sturdy built feels uncomfortable while moving from one place to another due to its weight.4.  On/Off switch is at the rear. Need to remove the tablet or tilt it with care to use the switch.5.  Since the switch is on the rear as also there is no indicator  to show its power on/off status, most of the times one tends to forget to switch it off after use leading to drain of battery.6.  Initial connectivity is a bit slow.7.  Keys require a little more pressure than usual.VerdictIt is a more of a style statement at an affordable price. It is a good replacement for non-repairable expensive keyboards. Only two major issues of rear power switch and a charging socket, if resolved, would make it worth 5 stars. However, I find it to be the best available replacement for my Notion Ink Cain tablet, serving the dual purpose of a keyboard and a stand, in terms of size and usage.",
		"reviewStars": 3
	},
	{
		"reviewerName": "lavakumar",
		"reviewTitle": "not great for Ipads",
		"reviewBody": "The keyboard works fine but it can't support an Ipad( air 4) placed in the slot.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Rhucha",
		"reviewTitle": "Great keyboard plus stand",
		"reviewBody": "This ia amazing for tablets. The keys are sturdy and ergonomic. Look is finished.You can also use it as a stand for video calls or video dance/yoga sessions, just place your tablet facing opposite direction to the keys.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Dr. Z.",
		"reviewTitle": "Could have been better",
		"reviewBody": "Pretty heavy for a keyboard(that is good) and feels sturdy. the keys feel like they have been made from cheap plastic.the groove for placing the device could have been 2mm bigger to accomodate biger tablets like the iPad Pro 12.9(i know it is in the description that bigger tablets will not be supported)typing comfort is not that great compared to other logitech keyboards i have used in the pastlooking at the box, looks like this package was sold to someone else(probably used and returned) and now sold to me. it does have a single scratch on the plastic(not that i am concerned about)",
		"reviewStars": 3
	},
	{
		"reviewerName": "Aashish Tolani",
		"reviewTitle": "I ordered it for practice on python and typing practice,and obviously it did really good",
		"reviewBody": "I like the most ,it's connectivity and cool design",
		"reviewStars": 5
	},
	{
		"reviewerName": "Mayank Ahar",
		"reviewTitle": "There should be a trackpad version of this as well. This thing is really good for multitasking.",
		"reviewBody": "there should be a tackpad version of this keyboard which will be well suited for TV etc.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Karthik Dupakuntla",
		"reviewTitle": "Average Product",
		"reviewBody": "Giving 3 stars only because capslock indicator is not there and this poses as a serious drawback (especially when entering passwords). Secondly it doesn't have a feature to adjust height, from ergonomics point of view it is not great. However, Keyboard is sturdy and feels good.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Anirudh Kumar",
		"reviewTitle": "Good, not great.",
		"reviewBody": "Really good for basic typing. The keyboard layout is a bit small so takes a bit getting used to. However, does quite a good job with 3 different bluetooth connections and can hold my phone while I work on my laptop.",
		"reviewStars": 4
	},
	{
		"reviewerName": "vaishali jadhav",
		"reviewTitle": "I like it",
		"reviewBody": "Easy for writing story.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Abhinav",
		"reviewTitle": "Great compact bluetooth keyboard",
		"reviewBody": "ProsBuilt quality is superb.Easy pairing.Toggle knob for selecting the devices.Slot for tablet and phone.It's heavy and base have rubber pad which makes is really stick to the surface.The key have enough space which helps to reduce wrong key strokes.Key are not linear they have a actuation point which feel good while typing.ConcI found the key are on a little bit harder side. A bit harder then cherry blues. I won't prefer it for long typing sessions.",
		"reviewStars": 5
	},
	{
		"reviewerName": "saurabh",
		"reviewTitle": "Not for fast typing and hence not for work",
		"reviewBody": "Hi,\"This keyboard isnot for fast typing when you are responding or writing emails.It tendstomiss keys. ALTHOUGH i AM USING IT SINCE COUPLE of days now, have built a hbit of pressing the keyshard but still missing important keys like space bar or caps lock or few other alphabets. No home or end keys are alsomaking the tasks bitmore difficult for me. On top of everything, i threw the package and the box and hence can'treturn it but have to live with this noisy hard presserkeyboard\"Above review was written using this keyboard without correcting the mistakes caused by this Keyboard.If you want a keyboard which likes beating for stressbusting then this one is for you, beat it hard and it will make even louder noises while typing. Well done Logitech QA department to have this model in market and salute to 10,000+ people using it with positive reviews.",
		"reviewStars": 2
	},
	{
		"reviewerName": "veer",
		"reviewTitle": "A decent multi-device compact wireless keyboard!",
		"reviewBody": "Overall Excellent Build Quality. The keys have decent feedback and are ergonomically designed which makes it easier to type. The rotatory switch works really well, I have paired the keyboard to  android and iOS devices as well as a laptop. Changing connections for different devices is as easy as rotating the switch to the right position. The groove to hold phones/tablets is rubberized and keeps up the devices firmly. Battery management seems good as the keyboard goes to sleep when no device is being used and wakes up soon as it identifies a Bluetooth connection.Only thing that I didn't like was the very flimsy battery cover which seems to come off with little or no effort, once lost in travel it may be difficult to replace and shall be an eyesore with the batteries exposed. The other thing to keep in mind is the weight of the keyboard, while very compact it is fairly heavy (around 850 gms), you wouldn't anticipate the weight looking at the size of the device, keep this in mind if you're planning to travel with it  a lot!Update: the battery lasts for slightly more than a year on fair (1-2 hrs/day) usage.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Karthik",
		"reviewTitle": "Cons of the keyboard",
		"reviewBody": "I had bought this keyboard and it had been working well . The only 2 problems i face are , the keyboard is too heavy and thick . It is portable and can fit in any laptop bag but i did not feel very comfortable with its weight . The second problem is that at the back of the keyboard the upper layer is scraped up a bit and there is a gap between the upper and lower layers of plastic . It clearly not the design but it is due to some damage caused to it during the transport .",
		"reviewStars": 4
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "Little heavier",
		"reviewBody": "Little heavier but very good for type purpose.You will feel it's weight when you try to change its position (try to bring close while typing) as compared to usually using keyboard",
		"reviewStars": 5
	},
	{
		"reviewerName": "siva",
		"reviewTitle": "Please don't purchase by reading it review.",
		"reviewBody": "My keyboard stops working after 15 days. Now I'm unable to replace it.",
		"reviewStars": 1
	},
	{
		"reviewerName": "Monika",
		"reviewTitle": "Good one!",
		"reviewBody": "This Keyboard is truly a good to go product but while typing you can feel the sound which discomforts you if you were using Mac. Other than that, it is perfect one which connects easily with any Bluetooth device and switching between devices is such a cool feature that I loved.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Sen",
		"reviewTitle": "Works like a charm but bit bulky",
		"reviewBody": "Works well with iOS and Android devices, I love it and I am able to dock my iPad Air and continue my work. The multi choice knob let's you to toggle between 3 devices once you pair them with just turn of the knob.Cons:1. bit bulky, if you are looking to carry along with your iPad or tablet then this is not the one you should look for.2. With 820 gms of weight it is definitely feels heavy3. It runs on 2 AA battery, while Logitech claims that it lasts up to 24 months but not sure. I am ok even if it lasts for 6 months",
		"reviewStars": 5
	},
	{
		"reviewerName": "vaitheeshwaran",
		"reviewTitle": "Good Product",
		"reviewBody": "Product is good but the keys are little hard.",
		"reviewStars": 4
	},
	{
		"reviewerName": "sanket",
		"reviewTitle": "Nice product",
		"reviewBody": "Very nice product from Logitech. Very compact and easy to operate as well as to connect. Works on 2 AA batteries so no need to worry about charging or changing battery frequently.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Midhun",
		"reviewTitle": "Convenient and Reliable",
		"reviewBody": "A convenient and reliable keyboard to have if you work with multiple devices at the same time. The keyboard is sturdy, and there isn't any learning curve. It can simplify your workflow paired with a Bluetooth mouse-like Logitech M590/585.The keyboard does make some noise while typing, but it isn't annoying. If you are looking for a very quiet keyboad, then this may not be for you.It doesn't have a backlight. Hence typing in the dark could be a challenge if you need to look at the keys while typing.",
		"reviewStars": 4
	},
	{
		"reviewerName": "A Sunil Kumar",
		"reviewTitle": "An easy to use budget keyboard",
		"reviewBody": "Works with my MacBook quite efficiently. The initial impression was that it was too small (Took a couple of hours to get adjusted). Keep in mind that you can't compare it with Mac Keyboard but it's quite usable. You might just need to type a bit hard compared to Mac. Setup is quite easy and it doesn't disappoint, you can easity connect with mix of 3 devices. Go fot it without any doubts and keep in mind that it takes some time to get used to it, if you are using macbook. Once you get used to it, you'll feel very happy about this purchase.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Kiran Kumar K",
		"reviewTitle": "Keyboard buttons stuck after 2 months and Bluetooth stopped working after 1 year.",
		"reviewBody": "My first impression was awesome as I see this key board seamlessly connecting to all my 3 devices, PC, iPhone, iPad with a flick of a button. I enjoyed it too. After 2 to 3 months, the buttons became very hard to press, some times my finger was stopped to press.. I need to find a nice angle to press it. Exactly after 1 year of warranty period.. suddenly the Bluetooth stopped working out of no reason. I bought it on 11th feb 2021 and today is 11th march 2022. My house is protected by dust and air-purifier but still the key board stuck.",
		"reviewStars": 2
	},
	{
		"reviewerName": "Danby",
		"reviewTitle": "Good while it lasted, Useless after 12 months. 🙁",
		"reviewBody": "The quality of Logitech keyboards is disappointing. I've owned 3 so far, and everyone of them has died after a relatively short time. This one lasted only 12 months! Now, one of the keys is typing randomly, and I can't stop it - making the whole product unusable except as a big heavy tablet stand. Buyer beware!Also, this keyboard has the drawbacks of being larger and heavier than the K380, but for some bizarre reason the K380 is currently only available in India for over 3 times the price! I bought the K380 while I was in Singapore, but that also stopped working after a similar time frame with similar issues.I bought a smaller and lighter Macally keyboard at the same time as this one (K480 for tablet, Macally for laptop), and that one is still going strong, showing a higher quality, but I had to get it imported from the US.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Vijay Kumar",
		"reviewTitle": "This is perfect for me.  I like it",
		"reviewBody": "Pros:-This product looks great.-Easy to use.-Value for money.-Feel while typing is great.-Built in holder for phone and iPad 9.7 at the same time.-Head turner- feels very very sturdy while typing- keys are in right place especially for people who need the fast response from keyboard while typingCons:-Heavy to Carry if concerned about weight. May be is done with a purpose to hold mobile and ipad together. But could have been better.-First delivered piece was not even to hold on the flat surface. It was dancing like a uneven chair.-Hence returned and exchanged.",
		"reviewStars": 4
	},
	{
		"reviewerName": "smp",
		"reviewTitle": "Smaller than laptop keyboard, disrupts your typing initially",
		"reviewBody": "Little heavy,, a little smaller than laptop keyboard, buttons are also smaller, will disrupt your typing initially, the keys are not chocolate keys (like on laptop), hence lot of typing noise. but its features overcompensate. Connection with modern laptops is quite seamless (1sec).",
		"reviewStars": 4
	},
	{
		"reviewerName": "Rajan Varghese",
		"reviewTitle": "Good",
		"reviewBody": "Not very sturdy, little pricy",
		"reviewStars": 4
	},
	{
		"reviewerName": "Fennington S.",
		"reviewTitle": "Good keyboard",
		"reviewBody": "This is a very good product, especially considering the price point. I would have given 5 star if not for the weight. Its slight heavy. Performance wise nothing to complain.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Utkarsh Kushagra",
		"reviewTitle": "Specefic Needs.",
		"reviewBody": "CONS :1.A little bit on the bulky side.2.AA non rechargeable battery.3. Oil and other marks stay on the plasticPROS :1. The tab/phone cradle is a huge bonus2. Connects to 3 devices and switching between them is easy3. Cheap for the premium look that it carriesConclusion : Literally the best option for people who use multiple devices like me. Also for office goers.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Animesh",
		"reviewTitle": "Whoa a hit...",
		"reviewBody": "Ohhhhhh wow...... Okay easy to pair but expensive as my opinion but better than apple magic keyboard  so go ahead",
		"reviewStars": 4
	},
	{
		"reviewerName": "Rajesh",
		"reviewTitle": "Good try but needs to improve",
		"reviewBody": "Pros:1. Switchability is great2. Keys shape and sound and travel mechanism is the most awesome - only 90s kids will know what a treasure this is3. Compact - all wireless keyboards are the BIG ones4. Sometimes bluetooth connection with laptop drops and we have to remove and pair again - this is the real disappointmentConcerns:1. Power button needs to be accessible maybe2. Need layout customizability + no labeling of keys like home, page down3. Need to be able to default behavior of function keys - i.e. F11 is more useful than increase volume - Windows also doesn't make it easy to change this4. Little bit on the heavy side - can fall if you're not conscious of the weight - hopefully it's tested for rough usageGood effort overall",
		"reviewStars": 3
	},
	{
		"reviewerName": "Sameer K",
		"reviewTitle": "Works well with MacBook Pro 2019",
		"reviewBody": "I use this regularly with MacBook Pro 2019 and Windows Laptop and it does the job perfectly. Love the island style layout and the connection dial. Highly recommended for Mac users. For Windows users there are cheaper options available that work equally well.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Oindrila Banerjee",
		"reviewTitle": "Good keyboard but a bit heavy",
		"reviewBody": "The product is very good. Hardly any latency. But the weight of the product is on the heavier side. Apart from that, the keyboard rocks on the portability.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Amrendra",
		"reviewTitle": "Recommended",
		"reviewBody": "Everything's perfect except its size and weight....like its so bulky to carry around.....other than that.......works fine looks cool. Also the keys are a bit hard to press.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Agnes Muani",
		"reviewTitle": "Good quality material and easy to use",
		"reviewBody": "The Keyboard is heavy enough to hold my 10.1 Lenovo tab. It can hold your phone. Tab is bending a little backward so it is comfortable while typing. The size of the keys are same as that of the 15.6 inch laptop keyboard. I pair it with Logitech Bluetooth mouse. I spent Rs 3900  for the keyboard and mouse. It arrived today. So, i shall give my review after few months about its durability.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Sachin Bhavsar",
		"reviewTitle": "Excellent!",
		"reviewBody": "Pros:- Superior build quality- Good finishing- Easy to pair- Sturdy- Very low consumption of battery. I didn't need to replace since I bought an year ago.Cons- The keys are not as smooth as compared to apple keyboard but not too rough either.Nothing to complain about. I am satisfied and happy with the product after using it for one year.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Vijay",
		"reviewTitle": "Superb converted i pad to mac",
		"reviewBody": "Superb connectivity",
		"reviewStars": 5
	},
	{
		"reviewerName": "Santhosh Bhat",
		"reviewTitle": "No caps lock indicator?",
		"reviewBody": "Although it's a great and sleek keyboard, it is missing some of the key features.1. There is no caps lock indication2. There is no way to adjust the keyboard inclinationThe keys are bit hard but overall I liked the product. The setup and compatibility with MacBook Pro is great.",
		"reviewStars": 4
	},
	{
		"reviewerName": "SM",
		"reviewTitle": "Great keyboard but breaks BT headphones",
		"reviewBody": "Updated review, reduced from 5 stars to 3 for a huge problem: This keyboard makes BT headphones connected to the same macbook unusable.Pros:1. Uses 2 AAA batteries, easily replaced. Came with alkaline pre-installed.2. Has a switch to pair with Windows OR mac devices. This flips the alt/cmd keys around so you don't have to use the keyboard mapper.3. Has a rotary selector to switch dynamically between 3 devices.4. Has a builtin groove to prop up an ipad or an iphone, making this a very practical dock.5. Last but not least, has a dedicated physical power switch to turn the batteries off.Cons1. Thicker than other similar devices.2. Keyboard lies flat, can't be tilted without putting something else underneath.3. BT HEADPHONES CAN NOT BE USED WITH THE SAME MACBOOK.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Arush Singla",
		"reviewTitle": "Heavy but durable, well built product",
		"reviewBody": "Looks and feels like a premium product. And as it can connect to multiple devices, quite useful. I like the fact it uses AAA batteries and lasts for a year or so on single set. No need to charge. Its is quite heavy and thick hence can not carried with ipad case. Rest looks durable and well built.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Janmejay Singh",
		"reviewTitle": "Decent",
		"reviewBody": "Seems decent. Looks good but keys are of not very good quality.Otherwise works well.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Narendra Chauhan",
		"reviewTitle": "Nice product !",
		"reviewBody": "Works perfectly with my iPad and phone. I use it mainly for working in MS Office. Pressing the keys gives a good experience. I don't mind the sound produced by the keys, deep down I like it. it would have been better if its size and weight were reduced. Right now, typing with my newly bought K480.",
		"reviewStars": 5
	},
	{
		"reviewerName": "urvashi",
		"reviewTitle": "Best keyboard ever.",
		"reviewBody": "Loved the keyboard and the ease with which I could use it on my laptop, cell phone and tab all at once.The only issue I had was it kept unpairing itself from my iPad. But later it was steady.It's heavy to be honest. But at this price it's still a good deal.  Super simple to use. Very chic design . Very functional. Didn't find it difficult to use it at all.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Jay",
		"reviewTitle": "By far the worst wireless keyboard I have used",
		"reviewBody": "I have used many wireless keyboards, for more than 5 years now. Mostly from Microsoft, some from local manufacturers, and this was my first Logitech device.First up, lets do the good stuff. The switch thing is actually good. You can switch between multiple devices, which is excellent for a multi Tasker such as myself. Second, the tablet holder (that big green/yellow slot at the top) is very solid. I can put my iPhone or iPad and they stand perfectly (although using the home button is a pain because it is inside the slot) without falling ever. It is excellent for working on mobile devices, on almost any surface because the built quality is solid. The whole thing is fairly heavy, so it never moves around while typing. The feedback on the typing (I am writing the review on the Logitech keyboard) is okay, but not as good as the lower priced but much Microsoft Wireless 2000 keyboard.The bad thing is some keys simply don't work. For instance, the back key work only occasionally. The up key does not work permanently. Also, the wake up time is insane. Bluetooth keyboards by nature go to sleep after some duration of non usage. However, they should wake (there, the back key did not work for almost 5 taps!) up within a few seconds. This one can take up 30 seconds, and even a minute to fully wake up. That means, after coming back from sleep, I have to almost a full minute to get full keyboard functionality.The speed of connectivity is perhaps the most important thing for any keyboard. If it takes almost a minute after every sleep, then why bother. Also, not all key mapping is available for Macs, so that is bad. and the back key not responding behaviour is present on other keys like the b key and s key as well. I don't know if I have a faulty keyboard, or the bluetooth signal is too weak.All in all, at least, as far the keyboard I am using, its a wasted investment for me. I should have sticked with Microsoft. I saw the tablet stand and the 3 way bluetooth switch and thought it wold be awesome.",
		"reviewStars": 2
	},
	{
		"reviewerName": "Pritam Mondal",
		"reviewTitle": "Decent Product. Gets the job done.",
		"reviewBody": "Good quality product. A little heavy so that the tab or phones can be placed on the grove and remains stable. It's not a great choice for gaming and keys are needed to be pressed a little harder which I hope will be smoother once I start using it.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Abhinav Mahanta",
		"reviewTitle": "Great keyboard but miss a tracking pad",
		"reviewBody": "I like this keyboard for the ergonomic design and spacing between keys but it's quite heavy and bulky and thus affects portability to a degree. For a keyboard of this size and cost, I think they should have added a track pad as well so as to make it complete. Without a mouse tracking pad, it feels incomplete given its size and weight",
		"reviewStars": 4
	},
	{
		"reviewerName": "Praveen",
		"reviewTitle": "Very helpfull who using multi device at a time",
		"reviewBody": "ProsI am using with that my Office laptop, Personal tesktop and my Ipad. And, I bought multi deveice mouse along with that. No need to swith mouse too. I am using one monitor for my personal desktop and office desktop. I bought hdmi swithcher for that. So, no need to change the hdmi cables.ConsThe slot in the keepad not suit my ipad, its slippery",
		"reviewStars": 4
	},
	{
		"reviewerName": "PM",
		"reviewTitle": "Great except for battery life",
		"reviewBody": "Battery is almost drained with in 5 months. Device switching functionality works great.",
		"reviewStars": 4
	},
	{
		"reviewerName": "vikas",
		"reviewTitle": "I found, not good for iPad",
		"reviewBody": "No suitable for Ipad",
		"reviewStars": 1
	},
	{
		"reviewerName": "Aadhar",
		"reviewTitle": "You must know before buying this keyboard",
		"reviewBody": "If you are a developer or hard gamer, think twice before buying this keyboard.There is no page up and page down button in keyboard.By default F1 to F12 are function keys. When you press alt + f4, it will not close your current window. If you want to have that setting, you need to install Logitech options software separately.The connectivity is good buy when you try to fast type then it misses some of the characters. You need to press each key precisely in order to get it typed.The key sound is ok but it sometime annoys since you type in your rhythm and later you find character is missing.It has more weight so can not be handy.There is mobile/tablet holder but if your mobile has some thick cover, then it will be hard to place it on inbuilt holder.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Pradnya",
		"reviewTitle": "Really worth it.",
		"reviewBody": "I really like this keyboard, nice typing experience, I like the typing noise.",
		"reviewStars": 4
	},
	{
		"reviewerName": "isiri",
		"reviewTitle": "Good product...price a bit high",
		"reviewBody": "It is a good product...but not really good for gaming but its definitely for general uses such as texting, writing essays..etc. It was really helpful for me as I had a tablet and wanted to make it look more like a laptop and this product really helped...",
		"reviewStars": 4
	},
	{
		"reviewerName": "Shaunak Basu",
		"reviewTitle": "Great product, again from Logitech",
		"reviewBody": "When you buy a keyboard/ mouse from Logitech - I think you can almost blindly trust its quality.This is again a great product.I bought it mainly as a companion for my Huawei M5 lite Tab so that I can get some serious typing done on it as and when required. And this keyboard does not disappoint. It is quite heavy and the keys are well spaced out. Being heavy is an advantage here because I can put my tab on the ditch on the keyboard so that I can better see what I am typing without it wobbling.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Rohan Shetty",
		"reviewTitle": "Worth the price... overall a great keyboard",
		"reviewBody": "Great keyboard although you need to get used to the layout once... Pros: the switching between devices is quick and the stand is very helpful... Cons : can't call it portable as it's chunky and heavy",
		"reviewStars": 4
	},
	{
		"reviewerName": "S K Naseer Ahmed",
		"reviewTitle": "A MUST HAVE ACCESSORY FOR ALL IPAD USERS AND TABLET OWNERS",
		"reviewBody": "THE NEW LOGITECH K 480 WIRELESS KEYBOARD HAS BEEN DELIVERED BY AMAZON ON 11.01.2020. THE PACKAGING BY AMAZING IS GOOD AND MINIMALISTIC, VERY EASY TO UNBOX. IT IS A VERY GOOD EXPERIENCE USING THE WIRELESS KEYBOARD. THE KEYS ARE CIRCULAR IN DESIGN AND ARE VERY TACTILE WHILE USING. THE ONLY DRAWBACK OF THIS LOGITECH WIRELESS KEYBOARD IS THE KEY SOUNDS WHILE TYPING, APART FROM IT THE USER EXPERIENCE is MIND BLOWING AND IT IS A REAL VALUE FOR MONEY. THE CONNECTIVITY IS ALSO SMOOTH AND FAST WITH OUT ANY HASSLE. I AM USING IT FOR MY IPAD AIR 3 10.5 INCH. THE KEYBOARD CRADLE IS STRONG ENOUGH TO HOLD THE IPAD AIR 3 EVEN WHILE USING ON MY LAP. I DIDNT NOTICE ANY CHANCES OF IPAD FALLING DOWN FROM THE CRADLE.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Saaquib Neyazi",
		"reviewTitle": "Best  buying",
		"reviewBody": "",
		"reviewStars": 5
	},
	{
		"reviewerName": "Pranav",
		"reviewTitle": "Not a good choice for developers",
		"reviewBody": "Not handy for developers. Make it hard to deal with Linux terminal.Also the right arrow key and ‘?' Keys start disfunction in just 3 months of use.",
		"reviewStars": 1
	},
	{
		"reviewerName": "Shunmugam V",
		"reviewTitle": "Gorgeous",
		"reviewBody": "Gorgeous in white. Ofcourse yeah need to take a little extra care to keep it gorgeous for ever.But the battery that came along wasn't working which made me to fear thag the product itself is defective. But once replacing the battery it works like a charm.Yeah, battery thing made me disappointed that's why one 4 stars.Else would have given 5",
		"reviewStars": 4
	},
	{
		"reviewerName": "Manohar Vengala",
		"reviewTitle": "Rechargeable batteries would be better",
		"reviewBody": "Draining batteries very fast. Rechargeable batteries would better. Keyboard is soft and easy to use but when batteries are drained it is working weird like if you press one key it is typing multiple letters",
		"reviewStars": 4
	},
	{
		"reviewerName": "Imran M.",
		"reviewTitle": "Amazing",
		"reviewBody": "Super easy to use and an Amazing Product",
		"reviewStars": 5
	},
	{
		"reviewerName": "Mukesh",
		"reviewTitle": "Good quality",
		"reviewBody": "It is of very good quality but little heavy. Not supporting for playing the games",
		"reviewStars": 4
	},
	{
		"reviewerName": "SA",
		"reviewTitle": "Big one but good one",
		"reviewBody": "The keyboard is pretty big.  My mistake for not checking the size properly but it is really big.  I have used the Logitech canvas with my iPad Air 2 which comes with a case - that was really sleek.  The keys on this one feel very plasticy.  But for 2000 Rs you wont get anything like this.Paired with ipad and iphone.  No issues at all.  Switches easily between the two without a problem.  No lag in typing.  Slight sound of the keys but not an issue.I should have used my brains - for a keyboard to be able to hold the ipad in landscape mode, it had to be broader than the ipad by a few more inches which makes it pretty big!!  So its not the most portable thing in the world. But it surely is well priced.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Puneeth",
		"reviewTitle": "Lots to give at this price point...👌✨",
		"reviewBody": "Feels good in hand and its bit on heavier side...comapct and portable....and the pairing capability  switching between various devicea is flawless....moving from a laptop keyboard to this keyboard layout it took quite time to adapt to this layout....May be thats due to cramped key space in laptop and this layout has spacious key placements....keys are good for this price range. I love the fact it doesnt need a dongle to connect...finally so good for this budget..i would recommend this.. when it comes gaming i would rather stick with my laptop keyboard...but this one also good for this price range",
		"reviewStars": 5
	},
	{
		"reviewerName": "Ganesh",
		"reviewTitle": "Very handy",
		"reviewBody": "Very essential for frequent travelers with multiple laptop and devices",
		"reviewStars": 4
	},
	{
		"reviewerName": "Keviv Ruhtam",
		"reviewTitle": "Good For  You If You Have Small Hands and Small Devices",
		"reviewBody": "I will tell you the truth.... I was floored by the good reviews and cute looking product here, as I was looking for a decent keyboard for working on my two laptops and a tab simultaneously. Unfortunatelty, when I received the keyboard, all my dreams went to pieces over the fact that it is not all suitable for connecting to devices where you spend prolonged and serious time. The keys are too small for any serious typing purposes  and the ergonomics of the keyboard are such that you cannot use it for a long time without considerable discomfort.I am sure that the keyboard functions properly, but my short and sweet advise is this --> This keyboard not only looks like a toy, it actually IS as toy!! You can buy it for occasional typing on mobiles or searching something on the tab, or maybe use it to find movies on your TV. That's about it. Do not even consider buying this for serious typing/coding work or gaming. You will be greatly disappointed.",
		"reviewStars": 2
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "value for moneyu",
		"reviewBody": "I am using it with my Mac as the original Magic keyboard is more than 3 times the price... nice keyboard... just that the tilt angle is not proper and I had to put some spacers below to increase the tilt angle.... otherwise working perfectly... the 3 device selectors are very useful...",
		"reviewStars": 4
	},
	{
		"reviewerName": "Ajay A P",
		"reviewTitle": "Affordable portable keyboard for all tablets and phones",
		"reviewBody": "A decent and affordable bluetooth keyboard for those who use tablets and phones as much as their laptops. Its more on the heavier side and for good measure as it has to support tablets in the yellow groove without tipping. The weight provides the necessary counter balance. This might also be a deal breaker for some. Connectivity is quick and switching between devices was seamless (problems if any can also be due to the device you are connecting it to). Overall a standard logitech product. Battery has lasted me for more than three months but then I don't use it on a regular basis. DO note that a lack of palm rest might cause wrist fatigue if used for long duration (more than half hour of continuous typing). If you intend it to be your main keyboard or you intend to do a lot of typing, look for ergonomically designed dedicated keyboards, This is more for portability and short duration uses.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Geeta",
		"reviewTitle": "AMAZING KEYBOARD",
		"reviewBody": "Today i have recive my Logitech k480 keyboard and i just love it. It's a bit heavy but its good . It's in big size and easy to type . In this you will get many short key like option to take screen short, volume  increase and decrease and mute option, forward and rewind option, and many more. It's easy to type.  I have ordered this in white colour and it include dura cells. I get this in 2595 RS. I JUSE LOVE IT",
		"reviewStars": 5
	},
	{
		"reviewerName": "Naveen Ravi",
		"reviewTitle": "A Happy customer",
		"reviewBody": "changing my review, writing this after working with this from last 10 days. device design and idea of multi device option is excellent. kudos to logitech team. i am able to use the same keyboard to my working laptop and to TV to control fire stick.in terms of device performance, time to switch between multiple devices is very very minimal and it is excellent one in connecting them. if we have mouse touch pad to it that will be other device which costs 4k , but for 2.5k this device is good.writing review with this keyboard only :-) finally a happy customer review..",
		"reviewStars": 5
	},
	{
		"reviewerName": "Akhtar Khan",
		"reviewTitle": "Not suitable for long term usage",
		"reviewBody": "ProsThe connectivity feature to easily switch between 3 devices is very cool and a handy feature, battery life is long lasting.ConsErgonomics of this keyboard is unthought of, there are no raisers to make it sit in slant position. Wrt portability it's small in size but adds ton of weight to carry it around.",
		"reviewStars": 2
	},
	{
		"reviewerName": "Dr Dhananjayvnakade",
		"reviewTitle": "Nice one",
		"reviewBody": "Heavy",
		"reviewStars": 4
	},
	{
		"reviewerName": "Pam",
		"reviewTitle": "Excellent keyboard for the iPad",
		"reviewBody": "This keyboard is excellent. I was a little worried about whether I wanted to buy this, or the official one from Apple. But this was an excellent decision.Not having my laptop with me right now was a real concern. And trying to type a whole bunch of pages on the iPad without a keyboard gets taxing. This keyboard made a lot of functions easier. I think the biggest thing about this is the fact that the keyboard has nearly normally spaced keys. So it doesn't cramp your hand up like the Apple keyboard for the iPad.Works fantastic. No issues connecting it. I especially like the multi device connection capacity that it has. You don't know how useful that is until you actually have access to using something like that. Makes working and texting simultaneously, easy.I bought the white one. Look wise it's great. People have been complaining about the weight but I don't think it's much. Maybe more than some other keyboards, but it's mostly for stability. The stability actually allows you to work with it on your lap with ease. So it's definitely not a drawback by any means.Definitely recommend it. And value for money for sure.",
		"reviewStars": 5
	},
	{
		"reviewerName": "HR",
		"reviewTitle": "A good product, amazon goofed up.",
		"reviewBody": "The overall product is amazing, connects and switches seamlessly between devices. Is bulky so may not be an ideal choice for carrying around. The slot provided for housing tablets and phones is made of rubber, holds the device steady without any fear of toppling over.The amazon goofup:This was a first, a buyer who had previously got this product ended up returning it due to its bulk. And the seller and amazon shipped the same product to me without even bothering to open the box and removing the information of the previous buyer. Although the product was new, flawless and worked perfectly after an initial hiccup, I decided to keep it.But its really annoying to find out that the product you recieved was not a new sealed one despite paying the full price of it. Hence I reduced a star rating.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "Over all a very nice product",
		"reviewBody": "Pros1. Mutiple device connectivity2. Super grip to hold tablet /Phone3. Nice design / Colour combination4. Smooth key boardCons1. Could have been lite more sleek and light weight2. Key board back light is a big time miss3. Would have been great if price point would ha e been around 2000Overall a very nice products",
		"reviewStars": 5
	},
	{
		"reviewerName": "Ashish",
		"reviewTitle": "Good product when used with multiple device",
		"reviewBody": "This keyboard is heavy in weight but if you want to use it for multi device, than performance of this keyboard is tremendous..very quick switching between multiple device..I am using it from last 2 month not a single issue I faceHighly recommended",
		"reviewStars": 5
	},
	{
		"reviewerName": "Ramakrishna",
		"reviewTitle": "Worth for money",
		"reviewBody": "Most effective for multiple devices.Pros :1. Easy to switch between devices.2. LED indication status for connection information.3. Rubber grip to hold the mobile.Cons:No Back light for the Keys.No information about Caps Lock.If they provided Low Battery information it could be useful.0.25 seconds typing delay will be there.Not suitable for continues typing people.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Tejaswa Dogney",
		"reviewTitle": "It's heavy but does the job done",
		"reviewBody": "Awesome keyboard, does what it says but let me mention you it's really heavy, idk what's causing the weight increase maybe it's because of real keyboard keys rather than the digital slim keys, i am using it for ipad air 4 and andriod without any issues",
		"reviewStars": 4
	},
	{
		"reviewerName": "Gokul Gupta",
		"reviewTitle": "Heavy",
		"reviewBody": "The product is heavy , so not exactly portable (it is heavier and larger that the tablet I am using it on)If you want to keep it at a desk it is perfect",
		"reviewStars": 5
	},
	{
		"reviewerName": "Akshay K.",
		"reviewTitle": "A DEVICE BUILT FOR MODERATE AMOUNT OF TYPING ON MULTIPLE DEVICES",
		"reviewBody": "The Logitech K480 Keyboard is good if your work requires you to type on more than one and up to three devices in quick succession. User needs to pair the device(s) only once. The tablet and mobile holding slot is a good inclusion. The build quality and feel of the product is good and it does not feel like a cheap device. The travel of keys is decent and does not make much noise like mechanical keyboards.I have been using this for a few days and have been typing extensively primarily on my laptop/computer and occasionally on my mobile phone (android). Transition between devices is seamless.Absence of palm rest (available on either side of trackpad of a laptop ) like most bluetooth keyboards makes the typing slightly less convenient compared to typing via a laptop keyboard itself. The pressing of keys is also a little harder (minorly noticed) compared to that of a laptop keyboard. The surface area of keys is also less than those on the laptop. The slightly hard key stroke combined with less surface area of keys makes for 'less than pleasent' typing experience. Unless the user is very accurate with his/her keystrokes, one is bound to press the wrong key sometimes while typing fast. Overall it is of good use for day to day usage (3 to 4 of A4 size, MS-Word or Evernote pages per day) but not the best product for extensive typing (say greater than or equal to 10 -15 A4, MS Word or Evernote pages per day).",
		"reviewStars": 3
	},
	{
		"reviewerName": "Binayak",
		"reviewTitle": "Bulky",
		"reviewBody": "It's a bit bulkier in size an although the length is small but it feels heavy and unfit for work purpose.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Karan Tulaskar",
		"reviewTitle": "Easy and handy for my Ipad",
		"reviewBody": "I had bought this portable keyboard for my Ipad. Because original Ipad keyboards are expensive. So this logitech keyboard is good to use. Easy to pair with bluetooth. Also you can pair it with the Laptops. However it did not paired with my HP Laptop. But my use for Ipad is sufficient. Portable to carry outside. I have not tried playing games.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Garant F.",
		"reviewTitle": "Too small for regular office desk use",
		"reviewBody": "purchased it but found it to be too small for my daily desk top use.Requested seller to take it back. Confirmed by Amazon but it has not been picked up by seller over past 1.5 months. Not sure what is going on!!!!",
		"reviewStars": 2
	},
	{
		"reviewerName": "Dipendra kumar lal",
		"reviewTitle": "Super cute keyboard with satisfying typing sound",
		"reviewBody": "Its is the best wireless Bluetooth keyboard one could have.-Best for iPad 10.2 or iPad pro 11 inch-It is easy to use as the keys are well spaced-Not very heavy even though its full sized-A full size keyboard with all the shortcut keys-super cute round elevated buttons-super cute typewriter like typing noise it makes (not too loud but pleasent sound)-multiple device support-comes with two batteries-amazing built qualityThere is nothing I don't like about this super cute Keyboard. Just go for it.",
		"reviewStars": 5
	},
	{
		"reviewerName": "vikrant",
		"reviewTitle": "No use waste of money",
		"reviewBody": "You can not play games or type fast with this keyboard to much delay and lag .",
		"reviewStars": 2
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "Good",
		"reviewBody": "Good",
		"reviewStars": 5
	},
	{
		"reviewerName": "SUDHIR BHARGAVA",
		"reviewTitle": "Smart compact and sturdy",
		"reviewBody": "A well made keyboard which easily syncs well with my iPad and phone. The keys are soft and the keyboard complements my devices very well.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Amitkumar",
		"reviewTitle": "Nice product",
		"reviewBody": "Nice product, it connects automatically when you switch the divice. Good keyboard for multiple devices.",
		"reviewStars": 5
	},
	{
		"reviewerName": "An Amazon Customer",
		"reviewTitle": "Must have",
		"reviewBody": "well its a must have gadget for a person who travels a lot like me so as I can do client chats anywhere",
		"reviewStars": 5
	},
	{
		"reviewerName": "N. Rana",
		"reviewTitle": "Good piece on second try.",
		"reviewBody": "This is a good piece of equipment. Worth the money. But it took me 3 tries to get the right keyboard.I had initially ordered an apple keyboard knockoff which was doa. Then I ordered this same model. The piece I received looked new but creaked a lot when picking up. Also when I tried it out, about 5 keys did not work.After returning the second keyboard, I'd kind of lost hope. Ordered the same thing again from Appario retail. Finally received a good product. No creaking, feels much more solid. White color goes well with silver/gold iPad. This piece is durable (if you disregard the faulty product received earlier) and easy to use. Pairs up quickly with devices and also switches between devices effortlessly. Battery life is an unknown as it is going to take some time to discharge it. But going by the online description, should last about a year.What surprised me is that going by online reviews, it is not a very solid device and should be creaking and making plasticy noices. But the one I have now feels well built and solid. Maybe it's just the piece or the batch I dunno.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Mukul S.",
		"reviewTitle": "Good buy",
		"reviewBody": "This is a good external keyboard, can connect to multiple devices.  I bought it for my iPad.  It could be a little lighter though, and the keys could be a little more tactile.  Apart from these, the keyboard is great.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Shyam P.",
		"reviewTitle": "Happy with the purchase",
		"reviewBody": "For the price it's good, using it for samsung tab 8A. Few options don't work, bit on the heavier side. But comparing it with having a laptop at 30+k ₹ worth the buy.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "Good",
		"reviewBody": "Super",
		"reviewStars": 4
	},
	{
		"reviewerName": "Varun",
		"reviewTitle": "Great keyboard but noisy and heavy!",
		"reviewBody": "It's a pretty good keyboard and very convenient too. The keys are big with good travel.The only problems I have are:1. Very noisy(definitely can't be used in a library or a quiet cafe)2. Heavy(800g)",
		"reviewStars": 4
	},
	{
		"reviewerName": "Sasi Kumar",
		"reviewTitle": "The right keyboard for iPad",
		"reviewBody": "Very rugged and solid build. Quality of keys and the tactile feedback is excellent. For those who do a lot of documentation, typing etc., this is a real must. Good value for money. Can connect to multiple devices, Android, Windows and Mac. Portable and comfortable to use. The slot feature to place the device works perfectly. Definitely recommend to those who are looking for a keyboard for iPad.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Naveen Adiraju",
		"reviewTitle": "Hands down the best for Smart Tv and Mac",
		"reviewBody": "I have recently bought a smart tv which came with a smart remote with minimal buttons and also my MacBook Air keyboard isn't working properly, so this keyboard is a perfect solution for both problem and the best part is with just the rotating the dial, I switch between the Smart tv and the MacBook Air within seconds.Thanks to Logitech for making this product.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Vidyasagar Nerella",
		"reviewTitle": "Function over form",
		"reviewBody": "As the title says, you should definitely buy this if you need portability and cord-less convenience of switching between devices at the flick of a dial. The piece I was delivered was faulty (1 specific key needed to be pressed extra hard to register a key-press) but it did allow me to experience the comfort of carrying around a keyboard that can switch between devices seamlessly. Look elsewhere if you want an ergonomic keyboard though.",
		"reviewStars": 4
	},
	{
		"reviewerName": "jatin kumar",
		"reviewTitle": "Value for money",
		"reviewBody": "The K480 is a must if you have an iPad or tablet, it just makes your work more efficient and effective.Key travel can be an issue for the laptop users but I don't think the pc users will mind it at all.It's a bit bulky so the portability can be a bit difficult.Overall it's a great package if you work from home and do your work at the table most of the time.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "Best keyboard for Mac Pro on a budget !!",
		"reviewBody": "I'm using this keyboard for my Mac book pro 2017 with a touch bar, first off at this price range its a saviour compared to the 10k apple keyboard if you're on a budget and typing super fast is not your priority this is the keyboard for you.",
		"reviewStars": 4
	},
	{
		"reviewerName": "mathew thomas",
		"reviewTitle": "Failed to start........",
		"reviewBody": "Not turning ON. Received this produxt on 12/10/2022 . Opened box and when tried its not switching ON. Tried with other set of batteries but no change in result.",
		"reviewStars": 1
	},
	{
		"reviewerName": "Mahesh M",
		"reviewTitle": "Works well,fast pairing.",
		"reviewBody": "The keyboard pairs fast and offers good tactile feedback while typing.The slot would not hold a tablet with a case. The form factor is like a slab with no palm support.Overall a good product which reached me in a condition I can't describe.",
		"reviewStars": 4
	},
	{
		"reviewerName": "kshah",
		"reviewTitle": "Nice keyboard, heavy and big",
		"reviewBody": "Four star just because of weight. Very reasonably priced key board with paring support up to 3 devices. Pairing is very smooth and simple. I tried with android and windows 10 tablet.When I first paired with Windows 10 tablet, i was disappointed as tablet will loose connection with keyboard very often and will not restore connection unless bluetooth setting is opened. Searched google but of no avail.Since problem was not found in Android, it was evident that keyboard has no problem. It is with Windows only. I disabled OFF BLUETOOTH RADIO TO SAVE POWER in device manager and started working flawlessly.It's device holding slot makes this keyboard very useful. Weight is only draw back. Keys are not great but can't complaint as it just cost 1800 bucks that too BLUETOOTH.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Dileep K V",
		"reviewTitle": "Noisy clicking heavy keyboard without backlight",
		"reviewBody": "Typying noise is very highNo backlightHeavyNot compatible with Windows (connection issues)",
		"reviewStars": 4
	},
	{
		"reviewerName": "R E",
		"reviewTitle": "Excellent product. No regrets",
		"reviewBody": "An excellent product. Very simple to connect. The touch gives the good-old keyboard feel: be it the depth (interesting, as it is not as large as the regular keyboard), spacing (a little lesser than the keyboard, but more than that of the laptop), sturdily built. Using the bluetooth to connect is a plus, leaving the port free to charge the phone while using it or to connect the pendrive to it; plus, no worries about carrying or losing OTG adaptor/other accessories, the keyboard is more than enough. The keys are a bit noisy going clickety-click (like the good-ol' days' keyboards), so a particularly quiet environment may make you a bit conscious (eg. a library). Talking of budget, imagine...I saved 28K! If I had to get a laptop just because I needed to type my assignments, etc. I would have to spend that kind of money! So now, I invest in this, and when, in a couple of years, my phone conks off, I just need to put another 9K or 10K, which I can then use with this keyboard; after all, smartphones/tabs these days are almost as good as having a pc. You can do without a laptop, but not without a smartphone. Quality v/s Price: worth the investment. No performance issues.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Anvar",
		"reviewTitle": "Very good option for iPad Pro 10.5",
		"reviewBody": "I had an original apple keyboard which stopped working. I no way would spend 14k on a keyboard. Apple seriously? This logitech Keyboard A cheap and nice thing for iPad Pro 10.5 inch. Nothing beats anything in this price range. A bit heavy but it's to keep the iPad stable in the cradle. It also fits after you use a cover on iPad. Happy with the purchase.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Nafisa",
		"reviewTitle": "Ergonomic, Comfortable Keys, Ease of Use, Looks Exactly as Pictured",
		"reviewBody": "The only issue is the cushioning in the packaging, I feel it is not sufficient to protect the keyboard from damage during transport/travel. If you use sufficient padding, it will be more portable and easy and safe to travel with. Also, there is no manual so you have to refer to YouTube videos to learn to operate it.The Keyboard is just as pictured, the keys are very comfortable and easy to use, the green panel holds and supports extra devices like your phone, tablet, etc. It looks good. Great purchase!",
		"reviewStars": 5
	},
	{
		"reviewerName": "Hashim Jamal",
		"reviewTitle": "I have to use it because I bought it (go for K380 instead of this one) !!!",
		"reviewBody": "I have been using it for more than a month now, and here are my observations.- This is not so compact keyboard (a better option would be K380 keyboard which is silent and even smaller than this one)- The keyboard is very very noisy and I mean it, the sound of the keys is just so loud and very annoying- The cradle to keep the mobile phone / tablet does not work in my case as my Redmi Note 7 Pro continues to slip out of the cradle- This keyboard is not handy enough, the weight is over 800 grams and not easy to carry around. It will serve the purpose if you just keep it lying on a desk- The most irritating issue is the missing Home, End, Page Down and Page Up keys. The size of the arrow keys is also an issue, they are smaller compared to other keys so its not so easy to use them.- Although we can club the 'fn' key with arrow keys to use them as Home / End keys but many a times it becomes confusing and you end up using the mouse to do your work.- Only good thing about the keyboard is the Bluetooth connectivity which helped me free up one of my USB port on the laptop.",
		"reviewStars": 2
	},
	{
		"reviewerName": "Pavan Sathuluri",
		"reviewTitle": "Very heavy",
		"reviewBody": "Item is very heavy. Keys are not soft. They make noise with every tap",
		"reviewStars": 3
	},
	{
		"reviewerName": "sre",
		"reviewTitle": "Good Multi device Keyboard",
		"reviewBody": "Its a multi device keyboard works well in multiple platforms. Only thing i dont like is the the battery comparment thats a little bit loose and weight of product. Weight may be an advantage to hold big tabs.Pros :Virtually it Can be used in any devices that has buletooth. Tested on Android, windows, linux.Can operate 3 device at a time, switching is not an issue.Simple and Easy to pair .Good build quality.Good typing speed and no lags like some budget kb.Options to place tab and mobiles , can be used like laptop.very convienenat placing.Buletooth so low battery drain.Cons:Weight of the kbBattery compartment is a little bit loose.No mouse movement options like touch padOverall its anice kb that will be usefull if you type lot on multiple devices. Hope it will give a better battery life",
		"reviewStars": 4
	},
	{
		"reviewerName": "Simarjeet Singh Bhasin",
		"reviewTitle": "If only, keys could be less noisy.",
		"reviewBody": "I am a fan of this keyboard when I have to work on both my laptops simultaneously and need to keep an eye on my phone too. The dial and the slit to stand your phone/ tab are such a convenience. The key strokes are really loud, and if those would have been a regular logitech ones I am used to, I would have rated this product a full 5 stars. But still, I am satisfied with the overall product! It could have been a perfect experience easily!",
		"reviewStars": 4
	},
	{
		"reviewerName": "franklin Albert",
		"reviewTitle": "Very useful to my son MCA study",
		"reviewBody": "I buy this for my son study MCA. It's very useful for his projects ☺️",
		"reviewStars": 5
	},
	{
		"reviewerName": "Vibhav S.",
		"reviewTitle": "better than expected",
		"reviewBody": "- the keyboard is small and hence very comfortable for the wrists.- the holder is able to handle tablets up to 10 inches easily.- works with Android tablet, Android phone, iPhone, iPad, MacOS, Linux- I was worried about the round keys but they are no problem at all.## Cons- keypress feedback is really bad. When typing for a long time, I tend to miss some keys because they were not pressed completely.- the switch and indicator are at the bottom which can be tedious to operate. So many time, I forget to switch it off because of that.- the sticker at the top has bad glue. It should not be removed even though it looks ugly.- can feel slightly heavy sometimes. check the weight and get an estimate before buying",
		"reviewStars": 4
	},
	{
		"reviewerName": "RJ",
		"reviewTitle": "Good",
		"reviewBody": "Works very well with Android, Windows and Mac. The only irritation I felt (with Android) is that, if language switching is ON, pressing space bar changes the language (of GBoard) while typing. Can live with it.",
		"reviewStars": 4
	},
	{
		"reviewerName": "ed_raj",
		"reviewTitle": "Serves the purpose very well , cost effective .",
		"reviewBody": "Very handy and easy to use. Keys are well spaced. Size is somewhat on higher side for ease of transport. But it will function as a full sized key board. Jog dial is the best part. You can switch between devices.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Shubham Sadhuka",
		"reviewTitle": "Retro charm keyboard with classy look",
		"reviewBody": "The product is bang for the buck. The only let down is that it is big and bulky, Not portable if you want to carry it around with you to places. I specifically bought it for my iPad 2017 model. It is fairly big and the keys are evenly spaced out. Does not feel like a small keyboard at all. The keys have excellent key strokes and it gives a good feedback while typing. The pairing was also very seamless. Everytime i switch on the keyboard it pairs up within seconds with my iPad. Switching between devices does take a little time but is very insignificant. Overall best keyboard if you want to buy only for typing purposes for your mobile or tablets.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Ignatius Nayan D'Rozario",
		"reviewTitle": "Brilliant bluetooth keyboard. Works with everything",
		"reviewBody": "This is a solid keyboard. Connects very easily to everything.The keys are a little plastic ky but the ergonomics are just right. The keyboard is surprisingly well sizes so that the keys are well spaced and not crampedMy fingers traveled well while typing.Feels solid and is heavy enough to safely prop a tablet without toppling.The Mac keys take a little getting used to especially for Command Alt combos that need the Fn keys. But that's mostly for people like me who are heavy keyboard short cut users.Logitech is my current keyboard and mouse hero.Everything that I've bought and used have lasted for YEARS.They have THE Best battery life of any wireless keyboard or mouse I've have ever bought in the last 15 years",
		"reviewStars": 5
	},
	{
		"reviewerName": "Shasank",
		"reviewTitle": "Don't buy If you want to use for laptop",
		"reviewBody": "This keyboard works fine with mobile and tablets but it's keep disconnecting with the laptop. So I stopped using and found to be very irritating while using and when gets disconnect multiple times.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Akhtar",
		"reviewTitle": "Overpriced, no backlight",
		"reviewBody": "2200 INR keyboard which doesn't have backlight, it means it's unusable in dark. Who uses 3 device in keyboard. I have 3 laptop, 1 iPad, 2 mobile phone but I never got a need of using the key board on all these devices. Basic features is Missing and good to have feature is added. They should reconsider thier design methodology and customer requirements.",
		"reviewStars": 2
	},
	{
		"reviewerName": "Anand",
		"reviewTitle": "Very useful with mobile phones",
		"reviewBody": "This is heavy so that the tablet or phones will stand stable on this. Tested with Windows Laptop, MAC and iphone 12. Works well. Not as ergonomic as full size KB. But key positions are more or less alright.Long message chatting on mobile phones, this is the one..",
		"reviewStars": 5
	},
	{
		"reviewerName": "Saikat",
		"reviewTitle": "It will make you grow muscles on your fingers",
		"reviewBody": "This is a true martial artist's keyboard, and if you are not one, then you are far too weak to even consider this.The keys are designed specifically to help build fingers of steel, that can pierce through concrete after just a month of using it for daily work.Beware though, if you are not tough enough to withstand all the training that this piece of meticulously designed \"board\" has to offer, you will lose, and it will win, always! If you do master it though, the epitome of finger strength awaits you.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Thomas",
		"reviewTitle": "An ergonomic keyboard which will be useful for Mac and Android phones.",
		"reviewBody": "I was looking for a good blue tooth keyboard for my Mac as well as Android phones and I have tried some keyboard from local brands but those were not giving the satisfaction.  Hence I decided to buy this one and it gave me a good result.Spacing between the letters are standard and the feeling that we get while typing is also good.Easy to change between multiple devices and the best part is the keyboard doesn't need a dongle to connect with Mac.!",
		"reviewStars": 5
	},
	{
		"reviewerName": "D Mistry.",
		"reviewTitle": "nice keyboard with great prices",
		"reviewBody": "Keyboard is little heavy. I think the weight is to mount the ipad / phones and keep them steady.it switches between sources quickly. I tested on apple TV my macbook and raspberry pi (with kodi). works flawlessly.Only downside is the keystroke noise. My previous apple keyboard was quite so not used to such noise from the key press from K480overall value for money.",
		"reviewStars": 4
	},
	{
		"reviewerName": "MINTU",
		"reviewTitle": "Not bad at all.",
		"reviewBody": "A bit heavy but thats understandable.good build.key travel could have been lesser otherwise no issues.good connectivity even with 3 devices connected simultaneously.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Ambarish",
		"reviewTitle": "Worth the money if you have smart tv on android.",
		"reviewBody": "I have a first gen version ipad 2017 model A1701. I doubted initially that it will work with the 10.5 inch model. But was surprised to see it working very fine and effectively.The best part was that I know use this keyboard to sync with my android tv and search content. So not only ipad , mobile but tv also I can run with this. Totally happy.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Placeholder",
		"reviewTitle": "Not so great typign experience",
		"reviewBody": "The product is satisfactory nothing moreThe only gripe is that the key board layout is different also if the keys would had a bit more like a k120 feel to it then that would be much more greatBut now the keys doesnt have that feel which we often get from logitech",
		"reviewStars": 4
	},
	{
		"reviewerName": "RealUser",
		"reviewTitle": "Good...",
		"reviewBody": "If compact and multi device is your need go for it.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Aman Kanwar",
		"reviewTitle": "Baught for 1800₹. The keyboard is very good, but make sure the product is brand new",
		"reviewBody": "The product works as shown in the video description.-- Battery Life--Not sure regarding the same as it depends on your use there is nothing to do with the keyboard as external battery cells are used-- Durability --If you hold it from one side you may hear a voice of plastic friction noise as the keyboard is total made of plastic.However, the keys are very smooth and are made of good quality.--Easy to use ---Product is designed to perform multitask, which it does without any error, the typing feels good on this keyboard and the switching between devices takes around 1/2 second.---------The keyboard is good for programmers specially, mine was a used one in an opened box which i returned and ordered a new one.I don't know, why these sellers sometime give used products to their customers, knowing that they will return it and give negative reviews and feedback.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Kindle Customer",
		"reviewTitle": "left control key not working at first, but solved.",
		"reviewBody": "The left control key did not work at first, and also stopped working again after a day. But turning the keyboard on and off using the switch at the back solved this issue.I miss a dedicated 'end' key.Setting up the keyboard was easy.Typing is smooth, though a bit noisy.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Vishal TK",
		"reviewTitle": "Review after 1 year usage :: Very Hard Keys",
		"reviewBody": "This is suitable only to use with tablets where you may not do too much typing. Keys are too tall and hard to press. It is not good to be used with laptops where you may code, write docs or emails. I regret buying this. At the moment this keyboard only servers the purpose of a stand for my iPad.If you are looking for a wireless keyboard for your laptop/desktop, go for dell or hp. In case you need a wireless keyboard for your tablet/phone, there aren't much good options available online. I would recommend visiting an offline store to experience the keyboard and buy or check with anyone who knows about a good wireless keyboard with soft keys",
		"reviewStars": 3
	},
	{
		"reviewerName": "lakshay chauhan",
		"reviewTitle": "Amazing!!",
		"reviewBody": "Great build qualityWorks flawlesslySurprisingly great value for money for the features",
		"reviewStars": 5
	},
	{
		"reviewerName": "pgs",
		"reviewTitle": "Works well but miss the backlighting",
		"reviewBody": "The clicking sound is music to my ears. Good feeback and can connect to multiple devices comfortably.  Could have had a backlight and a little lighter",
		"reviewStars": 3
	},
	{
		"reviewerName": "Sony",
		"reviewTitle": "Gibberish characters while typing",
		"reviewBody": "\\e\\e\\e\\e\\e\\e\\eptptptptptpt'a'a'a'a'a'a'a'a'aHi, Above are the keys appearing while I type e,t,a. Actually there are more gibberish characters with other key clicks, like using Caps or Shift.I am not able to enter my password, have to use delete/backspace to delete these extra characters. While googling I found this is an issue due to battery charge, so I removed batteries for couple of days and the keys were normal, no gibberish characters along with the keys.But now I am fedup, its in warranty, but I do not have another keyboard, I am using my laptop keyboard. Work is hampering and so is productivity.Really dont know how to resolve this issue, if anyone has faced something similar, please do post here.Thanks,",
		"reviewStars": 1
	},
	{
		"reviewerName": "Rajan Goyal",
		"reviewTitle": "Go for it! Eyes close!",
		"reviewBody": "It's super smooth, the whole experience! Logitech thumps up work!Connectivity super fast!Easy to install and use!Only if this product somehow had back lit keys this would have been the best keyboard under this price with these functions!",
		"reviewStars": 4
	},
	{
		"reviewerName": "Nagarajan",
		"reviewTitle": "Not a great product to buy",
		"reviewBody": "KEys are very harder. NO indication on caps lock. Battery life is good",
		"reviewStars": 2
	},
	{
		"reviewerName": "Surya",
		"reviewTitle": "One of the best products by Logitech",
		"reviewBody": "I ordered this after the lockdown, when we people started to work from home. It's almost a year now using this product. This keyboard was a great purchase. Has a mobile holder and connects upto 3 devices. The switching between devices is seamless and quick. I'ld recommend anyone with multiple laptops or mobile and wanna connect them to a single keyboard to check this out.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Shashank",
		"reviewTitle": "After a year, it started misbehaving",
		"reviewBody": "After a year of usage, it started loosing bluetooth connection frequently and suddenly a single key gets pressed multiple times. But the year long usage was great. Great key feedback and portable.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Pradeep PM",
		"reviewTitle": "From bad to worse",
		"reviewBody": "Good keyboard if you have multiple devices. I need to keep switching laptops, an iPad, and a desktop. Pairs on the first attempt, no complaints. Some points to consider before buying this.- The keys are noisy. I like it, some may hate it. Creeps into your telephone conversations/meetings.- Function keys are swapped, I am not sure how to put them back. F1 to F12 have defaulted to shortcuts I don't need them. I require the one used by Windows. Now I am forced to use the mouse.- Home and End buttons are missing. if you are dependent on those, this keyboard won't help, you need to compensate with other methods.- Alt-Tab between windows/tasks is hard to operate.Edit: After months of usage.- The keys are harder to press, it gets stressful to type emails, documents, etc This keyboard is simply not suited for long hours of typing. It is best suited for short bursts.- Looks nice only on youtube videos.- Alt-Tabbing between windows is dead, you need to have fingers made of lead to press it.- Causes rage, you'll end up occasionally smashing it due to lag while typing or playing some basic games.- as its too late to return this keyboard, I ended up repurposing this to less intensive tasks.",
		"reviewStars": 2
	},
	{
		"reviewerName": "VISHNU D.",
		"reviewTitle": "Good product",
		"reviewBody": "Good for long time normal usage on multiple devices... helps a lot for WFH... but Product weight is high... It weighs more than my hp elitebook... Not good for gaming... Typing sound is high even if this is a membrane keyboard...",
		"reviewStars": 4
	},
	{
		"reviewerName": "Amazon Customer",
		"reviewTitle": "Not meeting requirements",
		"reviewBody": "Keyboard and mouse are not pairing with my smart tv. So they are not meeting our requirements. I want to return the product and get refunded.",
		"reviewStars": 3
	},
	{
		"reviewerName": "Sreeraj",
		"reviewTitle": "Best multi device keyboard.",
		"reviewBody": "It's one of the best keyboards I have ever used. Very premium and functional product. Weight is on the heavier side ( than expected from usual keyboard sizes) . But it is very sturdy.I use with phone, laptop and a tablet.  Fast pairing and switching functionality. Battery lasts really long. It's been almost 9 months. And still holds battery.If the device is not connected to the PC after a reboot, just switch off and on again - immediately connects.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Subhodeep",
		"reviewTitle": "Versatile keyboard with a very competitive price",
		"reviewBody": "This is a great keyboard and does the job perfectly. I have an iPad Air 2 which I use regularly with this device and it connects almost instantly. Typing on this is really intuitive and effortless. You can use the keyboard both on the desk as well as comfortably on your lap as well. If you are not using the hard covers, you should be able to slot the iPad in without removing the cover. This feature is extremely useful to switch your iPad to a reader instantly by picking it up.It can be used both in potrait as well as landscape mode and works well with my iPhone and my wife's Nexus 5. All in all it is a perfect product at a very competitive price. I also did a lot of research on iPad covers that come with keyboards and all of them are priced upwards of 5k, are not wide enough to type comfortable, are bulky to carry around and reduces the iPad's portability. This product on the other hand is very versatile and at less than half the cost. This review is written on the keyboard while I have it on my lap while stretching on my couch.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Anurag Saha",
		"reviewTitle": "Awesome keyboard for multi device connectivity.",
		"reviewBody": "I got it to work on my Laptop, text on my smartphone and navigate my Android TV simultaniously just with a slide of a nob. I love the feature and it look and feel damn cool. Even though its a old keyboard, still worthy of the design in 2020.",
		"reviewStars": 4
	},
	{
		"reviewerName": "ASAVADI SUDHAMA VAMSI",
		"reviewTitle": "It's good",
		"reviewBody": "Good",
		"reviewStars": 3
	},
	{
		"reviewerName": "Rewati Tamang",
		"reviewTitle": "Heavy and poor quality keys!",
		"reviewBody": "It is quite for a portable keyboard, almost as heavy as a small laptop, key feedback is not that great either. Feels like typing on a toy keyboards. Also they have a replacement only policy on the product so be wary while ordering.",
		"reviewStars": 1
	},
	{
		"reviewerName": "Gurpreet Singh",
		"reviewTitle": "WHY don't buy",
		"reviewBody": "1. Weight is too much.2. keys are too hard even after 10 month usage3. Some characters get missed during typing4. Key got broken within 9 month",
		"reviewStars": 3
	},
	{
		"reviewerName": "anonymous",
		"reviewTitle": "Great keyboard",
		"reviewBody": "its great for normal use and also  for gaming",
		"reviewStars": 5
	},
	{
		"reviewerName": "ManJunath S",
		"reviewTitle": "Worth to have....!",
		"reviewBody": "This is a must have gadget , if u r typing too much...Size is acceptable, connection with 3 devices adds a star hear....The reason for a dropped star is keys...I didn't find these keys as user friendly... They r tough in nature, for the first time It remembered me typewriter typing ..  But we will get adjusted to this ....",
		"reviewStars": 4
	},
	{
		"reviewerName": "HP",
		"reviewTitle": "Good One but not for All",
		"reviewBody": "I am using with keyboard with Samsung Galaxy Tab S 10.5, Windows 10 PC and HTC Desire 820.1.The buttons are hard to touch and make significant amount of noise while typing but you'll get used to it soon.2.The keyboard is heavy at around 800 gms which makes it easy to hold large sized tablets but carrying it everywhere is not a good idea.3.The build quality of the keyboard does not justifies the price. The keyboard makes a lot of squeaking noises as if something is loose. I have tried 2 keyboards and both of them have the same issue.4.The slot given to keep the phones or tablets won't work if you use some case.Overall this is only for those who type a lot across multiple devices.At the price of 1899/- I feel this is overpriced.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Sanjay Arora",
		"reviewTitle": "Perfect for office work",
		"reviewBody": "After using this keyboard for 2 months I am writing this review. Connectivity is fast, no issues so far. Switching between devices takes a second but that is perfectly fine.Build quality is good . Keys sound is not disturbing.This all makes it a better companion for WFH.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Amit G.",
		"reviewTitle": "Worth the price... amazing product. go for it",
		"reviewBody": "Super fast delivery by amazon. Genuine product. Sealed in box.About the product. First impression, looks like a premium product. Just the right size in terms of portability and comfort in typing. Keys are well places. Ideal for using it in a multi device setup - Win, Mac, Phone. Connects with three devices by turning the simple dial on the left top of the key board. Well thought of cradle stand to put up a phone, tablet. Viewing angle is good.",
		"reviewStars": 5
	},
	{
		"reviewerName": "shah asad",
		"reviewTitle": "You will love to type",
		"reviewBody": "It is simply awesome. I am using it for more than a year now. Using it for Ipad. Really eased my work and I want to take notes more often now because of this.CONSOne keyboard got dysfunctional after a year. So i have to order second one.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Stanley. S",
		"reviewTitle": "A solid wireless keyboard!",
		"reviewBody": "Logitech delivers again with a great product!The key travel is amazing and supports both Windows and Mac keyboard layouts.The keyboard connects really quickly via bluetooth to whichever device you select on the mode dial. The option to be paired with 3 different devices is great too.It is powered by 2 AAA batteries and the keyboard automatically shuts off to save battery when bot used for a long time, which is nice!",
		"reviewStars": 5
	},
	{
		"reviewerName": "Minnie D.",
		"reviewTitle": "THIS PRODUCT IS NOT AS DESCRIBED.",
		"reviewBody": "I have been in touch with the seller to get a refund but THEY HAVE NOT RESPONDED TO MY MESSAGES. This product is not universal and my iPad falls backward out of it and crashes. It won't let me return, it will only let me exchange. I DO NOT WANT THE SAME FAULTY PRODUCT. PLEASE GET BACK TO ME AS SOON AS POSSIBLE WITH HOW TO RETURN.NONE OF THE NUMBERS I HAVE CALLED FOR APPARIO WORK. This company seems corrupt since they closed the window in one week and didn't offer returns without answering questions or responding to feedback. Now I cant get in touch with them. This seems like a trap. And APPARIO is the company that Amazon has decided to partner with in India.",
		"reviewStars": 1
	},
	{
		"reviewerName": "keerthivarman",
		"reviewTitle": "Perfect.",
		"reviewBody": "Pros1. Fits Ipad even with thick cover...2. I connected with three devices (MacBook, Ipad and Android devices) at the same time ands Switch Device works awesome with the roller key.3. I like this keyboard having physical Home button and background apps button and screen shot button, search button.Cons:1. You can't avoid key noices while typing.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Nitin",
		"reviewTitle": "Excellent Keyboard",
		"reviewBody": "Supersmooth. Review after 3 months of extensive typing!Go for it!",
		"reviewStars": 5
	},
	{
		"reviewerName": "Sujoy",
		"reviewTitle": "Little heavy but nice product",
		"reviewBody": "Connected w. Samsung Galaxy tab A10.1 and iPhone plus 7S immediately. Typing is easy.Little heavy and slightly big in size. Would not come in your laptop bag, unless the bag is really big.Overall a nice product for those who are not so comfortable in typing without keyboard",
		"reviewStars": 4
	},
	{
		"reviewerName": "Abhishek Mitra",
		"reviewTitle": "One Keyboard Multiple Devices",
		"reviewBody": "The keyboard does what it says, One Keyboard multiple devices (3 pairing possible at a time).The typing feel is nice, soft yet firm, doesn't feels fatigued. Has almost all function buttons.Insert available, Home and End missing. Dedicated print screen button available.",
		"reviewStars": 5
	},
	{
		"reviewerName": "wazulbuth",
		"reviewTitle": "Hear me out",
		"reviewBody": "I had brought this keyboard almost 3 years back. And this is what I think:This keyboard is bad. Aesthetically the keyboard is pleasing for sure. Ergonomically, it's alright. But the basic keyboard design is the only thing that is not what it should be.Keyboard Design: The keys are very noisy and has no feedback. You won't even know if you have clicked the button but your fellow roommate will hear you typing. Keys do not press evenly. Some need more pressure. In Windows, the Alt and Windows key for some reason shared the function weekly. For 3 days Alt becomes Windows key and vise versa. Yes, you got it right. That happened. I tried claiming the warranty but that was hard. I don't have Logitech service center around here. They told me that is the only way the warranty can be claimed.It has good things: Good bluetooth connectivity, longer battery life, it lasted more than a year. Seemless device switching. But it doesn't matter to me when the basic keyboard functionality is garbage.Don't get me wrong though. Logitech stand-alone is a great company. I have used their products and my friends have. I'm giving a second chance to Logitech in keyboards and I have bought another model. MK275.In nutshell. I do not recommend this keyboard.",
		"reviewStars": 2
	},
	{
		"reviewerName": "Gurpreet Singh",
		"reviewTitle": "This is good one",
		"reviewBody": "Its good one. Just for it.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Ayush",
		"reviewTitle": "Worst Keyboard",
		"reviewBody": "Caps lock stopped working.",
		"reviewStars": 1
	},
	{
		"reviewerName": "Abhra",
		"reviewTitle": "Nice product",
		"reviewBody": "It was a gift for my gf and she is loving it!",
		"reviewStars": 4
	}
]