[
	{
		"reviewerName": "Preet Shah",
		"reviewTitle": "Easy to use, hard to carry",
		"reviewBody": "Pros: easy to use, keys feels like mechanical keyboard. Can connect 3 devices. Supports Mac and windows. Place holder for mobile devices ( However, I use it to place a pen)Cons: Expensive. Very heavy ( feels like Macbook air). There is lag in connection whenever you turn on your laptop.",
		"reviewStars": 4
	},
	{
		"reviewerName": "nirmal",
		"reviewTitle": "Not suitable for all",
		"reviewBody": "Only uses for typing if horizontal view is suitable to see what we typingThink twice before buying",
		"reviewStars": 4
	},
	{
		"reviewerName": "Haidri",
		"reviewTitle": "I don't like it because it not having urdu, persion language to write,",
		"reviewBody": "I don't like it because it not having urdu, persion languages to write,What it good in it, that is size, tecnology, performance..",
		"reviewStars": 4
	},
	{
		"reviewerName": "ABDUL BASITH",
		"reviewTitle": "Absolute Rubbish -> Moderately Good Product",
		"reviewBody": "Not working properly on macbook pro! Switches to junk characters frequently which is really frustrating!How did I fix ?The keyboard switches to symbol/junk characters when the option key is pressed. So, I had to disable the option key in the keyboard and live with it!Apart from that above problem, It's a good looking keyboard. The keys are smooth to handle. Due to its container for tablet/phones, the product is not as compact as you might be expecting.",
		"reviewStars": 4
	},
	{
		"reviewerName": "Parth Arora",
		"reviewTitle": "Better than expected",
		"reviewBody": "Build Quality is appreciable, does not feel like other cheap keyboards. Bluetooth connectivity is also great, connects to multiple devices with instant switching across devices. Worked well with the ipad.",
		"reviewStars": 5
	},
	{
		"reviewerName": "Latha Pillai",
		"reviewTitle": "Amazing product",
		"reviewBody": "Amazing product! Makes it super simple to work on multiple devices at the same time",
		"reviewStars": 5
	},
	{
		"reviewerName": "Rajesh Rathi",
		"reviewTitle": "Good portable keyboard to connect to multiple devices",
		"reviewBody": "It cleared clutter on my workstation. Keyboard is noisy and arrow keys are very small.",
		"reviewStars": 4
	},
	{
		"reviewerName": "abhinav",
		"reviewTitle": "Good Product for multiple connectivity",
		"reviewBody": "Thumps up guys!!",
		"reviewStars": 4
	},
	{
		"reviewerName": "pravinjha",
		"reviewTitle": "As expected and upto the mark",
		"reviewBody": "Very robust and stable. Easy to use as expected from Logitech.",
		"reviewStars": 5
	},
	{
		"reviewerName": "VINEET SHARMA",
		"reviewTitle": "Rugged",
		"reviewBody": "Sturdy product. But you have to use it with mouse as you can not select as there is no touch pad. Good for typing.",
		"reviewStars": 4
	}
]